{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "import numpy as np\n",
    "import nltk\n",
    "import pickle\n",
    "from nltk import word_tokenize, RegexpTokenizer,PunktSentenceTokenizer, sent_tokenize\n",
    "from nltk.stem import PorterStemmer\n",
    "from nltk.stem import WordNetLemmatizer\n",
    "from nltk.corpus import stopwords\n",
    "#nltk.download('stopwords')\n",
    "import gensim\n",
    "import gensim.corpora as corpora\n",
    "from gensim.utils import simple_preprocess\n",
    "from gensim.models import CoherenceModel"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "def prepro(query):\n",
    "    stop_words = stopwords.words('english')\n",
    "    lemmatiser = WordNetLemmatizer()\n",
    "    word_stemmer = PorterStemmer()\n",
    "    count = 0\n",
    "    tokens = gensim.utils.simple_preprocess(str(query), deacc=True)\n",
    "    count += len(tokens)\n",
    "    cleaned = [word for word in tokens if word not in stop_words]\n",
    "    lemmatized = [lemmatiser.lemmatize(word_stemmer.stem(word)) for word in cleaned]\n",
    "    return lemmatized"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "def normalise(query):\n",
    "    tokens = gensim.utils.simple_preprocess(str(query), deacc=True)\n",
    "    return tokens"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['machin', 'learn']"
      ]
     },
     "execution_count": 29,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "prepro('machine learning')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "all_info = pd.read_csv('graph_data_final.csv')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "Index(['id', 'author', 'title', 'publication_date', 'publication_type',\n",
       "       'abstract', 'language', 'journal', 'organisation_unit_code',\n",
       "       'organisation', 'department'],\n",
       "      dtype='object')"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "all_info.columns"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>id</th>\n",
       "      <th>author</th>\n",
       "      <th>title</th>\n",
       "      <th>publication_date</th>\n",
       "      <th>publication_type</th>\n",
       "      <th>abstract</th>\n",
       "      <th>language</th>\n",
       "      <th>journal</th>\n",
       "      <th>organisation_unit_code</th>\n",
       "      <th>organisation</th>\n",
       "      <th>department</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>108069.0</td>\n",
       "      <td>Schützeichel, Rainer</td>\n",
       "      <td>Die Perspektive des Städtebauers. Ein Blick au...</td>\n",
       "      <td>2016.0</td>\n",
       "      <td>Book Chapter</td>\n",
       "      <td>NaN</td>\n",
       "      <td>de</td>\n",
       "      <td>Grundlagen</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>127413.0</td>\n",
       "      <td>Schützeichel, Rainer</td>\n",
       "      <td>Einleitung. Wegmarken einer Theorie des archit...</td>\n",
       "      <td>2016.0</td>\n",
       "      <td>Book Chapter</td>\n",
       "      <td>NaN</td>\n",
       "      <td>de</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>127410.0</td>\n",
       "      <td>Schützeichel, Rainer</td>\n",
       "      <td>Tradition as a Means of Modernisation: The Cru...</td>\n",
       "      <td>2016.0</td>\n",
       "      <td>Book Chapter</td>\n",
       "      <td>NaN</td>\n",
       "      <td>en</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>28599.0</td>\n",
       "      <td>Schützeichel, Rainer</td>\n",
       "      <td>Architettura contestuale. Difesa di una proget...</td>\n",
       "      <td>2010.0</td>\n",
       "      <td>Book Chapter</td>\n",
       "      <td>NaN</td>\n",
       "      <td>it</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>319574.0</td>\n",
       "      <td>Schützeichel, Rainer</td>\n",
       "      <td>Die Stadt und das Haus</td>\n",
       "      <td>2010.0</td>\n",
       "      <td>Book Chapter</td>\n",
       "      <td>NaN</td>\n",
       "      <td>en||de</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "         id                author  \\\n",
       "0  108069.0  Schützeichel, Rainer   \n",
       "1  127413.0  Schützeichel, Rainer   \n",
       "2  127410.0  Schützeichel, Rainer   \n",
       "3   28599.0  Schützeichel, Rainer   \n",
       "4  319574.0  Schützeichel, Rainer   \n",
       "\n",
       "                                               title  publication_date  \\\n",
       "0  Die Perspektive des Städtebauers. Ein Blick au...            2016.0   \n",
       "1  Einleitung. Wegmarken einer Theorie des archit...            2016.0   \n",
       "2  Tradition as a Means of Modernisation: The Cru...            2016.0   \n",
       "3  Architettura contestuale. Difesa di una proget...            2010.0   \n",
       "4                             Die Stadt und das Haus            2010.0   \n",
       "\n",
       "  publication_type abstract language     journal  organisation_unit_code  \\\n",
       "0     Book Chapter      NaN       de  Grundlagen                     NaN   \n",
       "1     Book Chapter      NaN       de         NaN                     NaN   \n",
       "2     Book Chapter      NaN       en         NaN                     NaN   \n",
       "3     Book Chapter      NaN       it         NaN                     NaN   \n",
       "4     Book Chapter      NaN   en||de         NaN                     NaN   \n",
       "\n",
       "  organisation department  \n",
       "0          NaN        NaN  \n",
       "1          NaN        NaN  \n",
       "2          NaN        NaN  \n",
       "3          NaN        NaN  \n",
       "4          NaN        NaN  "
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "all_info.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 82,
   "metadata": {},
   "outputs": [],
   "source": [
    "def create_list(query_type):\n",
    "    dep_org_prof = []\n",
    "    for query in list(all_info[query_type].unique()):\n",
    "        dep_org_prof.append(normalise(query))\n",
    "    return dep_org_prof"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 93,
   "metadata": {},
   "outputs": [],
   "source": [
    "author_name = create_list('author')\n",
    "department = create_list('department') #Does not work - German\n",
    "organisation = create_list('organisation')[1:] #First is nan\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 287,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "True"
      ]
     },
     "execution_count": 287,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "['andreas'] in author_name"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Query Matching - Still need to do partial Matching"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 362,
   "metadata": {},
   "outputs": [],
   "source": [
    "import re\n",
    "def query_match(query):\n",
    "    norm_query = normalise(query)\n",
    "    matching_author = [all_info['author'].unique()[i] for i,v in enumerate(author_name) if set(norm_query) == set(v)]\n",
    "    #matching_org = [v for v in author_name if set(norm_query) == set(v)]\n",
    "    matching_org = [v for v in organisation if set(norm_query) == set(v)]\n",
    "    if matching_author == [] and matching_org == []:\n",
    "         # partial_matching_authors = [sublist for sublist in author_name for item in sublist if item in norm_query]\n",
    "        print('not an author')\n",
    "        print('not an organisation')\n",
    "    elif matching_author!=[]:\n",
    "        print('--------Neo4J query: Author--------')\n",
    "        print('--------Show Department--------')\n",
    "        print('MATCH (p:Person) - [r:WORKS_IN] - (d)')\n",
    "        print('WHERE p.name = '+'\\'' +' '.join(matching_author)+'\\'')\n",
    "        print('Return d')\n",
    "        print('--------Show Organisation--------')\n",
    "        print('MATCH (p:Person) - [r:BELONGS_TO] - (d)')\n",
    "        print('WHERE p.name = '+'\\'' +' '.join(matching_author)+'\\'')\n",
    "        print('Return d')\n",
    "        print('--------Show 10 most recent publications--------')\n",
    "        print('MATCH (p:Person) - [r:PUBLISHED] - (d)')\n",
    "        print('WHERE p.name = '+'\\'' +' '.join(matching_author)+'\\'')\n",
    "        print('Return d')\n",
    "        print('Limit 10')\n",
    "        print('--------Show 10 most common collaborators--------')\n",
    "        print('MATCH (p:Person)-[r1:PUBLISHED]-(pub:Publication)-[r2:PUBLISHED]-(c:Person)')\n",
    "        print('WHERE p.name = '+'\\'' +' '.join(matching_author)+'\\'')\n",
    "        print('WITH c, COUNT(pub) as cp')\n",
    "        print('RETURN c, cp')\n",
    "        print('ORDER BY cp DESCENDING')\n",
    "        print('LIMIT 10')\n",
    "        print('--------Show Expertise Areas--------')\n",
    "        print('MATCH (t:Topic) - [r:EXPERT_ON] - (p:Person)')\n",
    "        print('WHERE p.name = '+'\\'' +' '.join(matching_author)+'\\'')\n",
    "        print('RETURN r.weight, t')\n",
    "        print('ORDER BY r.weight DESC')\n",
    "    elif matching_org != []:\n",
    "        print('--------Neo4J query: Organisation--------')\n",
    "        print('MATCH (d:Department) - [:WORKS_IN] - (p:Person)')\n",
    "        print('WHERE p.name = ', matching_org)\n",
    "        print('ORDER by d.date DESC')\n",
    "        print('RETURN d')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "def expert_on_topic(query):\n",
    "    prepro_query = prepro(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 363,
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "--------Neo4J query: Author--------\n",
      "--------Show Department--------\n",
      "MATCH (p:Person) - [r:WORKS_IN] - (d)\n",
      "WHERE p.name = 'Ghaffari, Mohsen'\n",
      "Return d\n",
      "--------Show Organisation--------\n",
      "MATCH (p:Person) - [r:BELONGS_TO] - (d)\n",
      "WHERE p.name = 'Ghaffari, Mohsen'\n",
      "Return d\n",
      "--------Show 10 most recent publications--------\n",
      "MATCH (p:Person) - [r:PUBLISHED] - (d)\n",
      "WHERE p.name = 'Ghaffari, Mohsen'\n",
      "Return d\n",
      "Limit 10\n",
      "--------Show 10 most common collaborators--------\n",
      "MATCH (p:Person)-[r1:PUBLISHED]-(pub:Publication)-[r2:PUBLISHED]-(c:Person)\n",
      "WHERE p.name = 'Ghaffari, Mohsen'\n",
      "WITH c, COUNT(pub) as cp\n",
      "RETURN c, cp\n",
      "ORDER BY cp DESCENDING\n",
      "LIMIT 10\n"
     ]
    }
   ],
   "source": [
    "query = ('Mohsen Ghaffari')#Thomas Hofmann\n",
    "query_match(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 298,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['andreas', 'krause']"
      ]
     },
     "execution_count": 298,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "a = normalise(query)\n",
    "a"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 198,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[['trigo', 'isabel'],\n",
       " ['atmanspacher', 'harald'],\n",
       " ['andreasson', 'ingmar'],\n",
       " ['kabdaslı', 'isık'],\n",
       " ['diekmann', 'andreas'],\n",
       " ['sennheiser', 'andreas'],\n",
       " ['wenger', 'andreas'],\n",
       " ['horni', 'andreas'],\n",
       " ['tonnesmann', 'andreas'],\n",
       " ['schallhorn', 'andreas'],\n",
       " ['huber', 'andreas'],\n",
       " ['papritz', 'andreas', 'jurg'],\n",
       " ['bauder', 'andreas'],\n",
       " ['frei', 'andreas'],\n",
       " ['ulbig', 'andreas'],\n",
       " ['fischlin', 'andreas'],\n",
       " ['niang', 'diop', 'isabelle'],\n",
       " ['andreasen', 'lise'],\n",
       " ['hierlemann', 'andreas'],\n",
       " ['mansuy', 'isabelle'],\n",
       " ['biedermann', 'andreas'],\n",
       " ['stemmer', 'andreas'],\n",
       " ['ernst', 'andreas'],\n",
       " ['denk', 'andreas'],\n",
       " ['voigt', 'andreas'],\n",
       " ['brunschweiger', 'andreas'],\n",
       " ['mueller', 'andreas'],\n",
       " ['krause', 'andreas'],\n",
       " ['krause', 'andreas'],\n",
       " ['kispert', 'andreas'],\n",
       " ['bernasconi', 'andreas'],\n",
       " ['ruin', 'isabelle'],\n",
       " ['kunz', 'andreas'],\n",
       " ['schellenberger', 'andreas'],\n",
       " ['andreasen', 'rasmus'],\n",
       " ['isler', 'monika'],\n",
       " ['wigert', 'isabelle'],\n",
       " ['attinger'],\n",
       " ['schneider', 'andreas'],\n",
       " ['ohmura', 'atsumu'],\n",
       " ['fehlmann', 'isabelle'],\n",
       " ['wieck', 'andreas'],\n",
       " ['wimmer', 'andreas'],\n",
       " ['ishikawa', 'takashi'],\n",
       " ['schafer', 'andreas'],\n",
       " ['atelier', 'girot'],\n",
       " ['pira', 'andreas'],\n",
       " ['christen', 'andreas'],\n",
       " ['kalpakci', 'andreas'],\n",
       " ['iselin', 'david'],\n",
       " ['ishiguro', 'hiroshi'],\n",
       " ['wieser', 'andreas'],\n",
       " ['schulze', 'andreas'],\n",
       " ['kuchler', 'andreas'],\n",
       " ['luscher', 'andreas'],\n",
       " ['duner', 'isabelle'],\n",
       " ['pospischil', 'andreas'],\n",
       " ['brade', 'isolde'],\n",
       " ['rigling', 'andreas'],\n",
       " ['schmid', 'andreas'],\n",
       " ['concheiro', 'isabel'],\n",
       " ['graphischen', 'sammlung', 'der', 'eth', 'zurich'],\n",
       " ['zingg', 'andreas'],\n",
       " ['atamian', 'dimitar'],\n",
       " ['mauthe', 'andreas'],\n",
       " ['scheck', 'isabelle'],\n",
       " ['anastasaki', 'athina'],\n",
       " ['fichtner', 'andreas'],\n",
       " ['yilmaz', 'ismail'],\n",
       " ['agne', 'andreas'],\n",
       " ['atkins'],\n",
       " ['isler', 'helene'],\n",
       " ['metz', 'andreas'],\n",
       " ['bulan', 'andreas'],\n",
       " ['petzold', 'andreas'],\n",
       " ['hoenger', 'andreas'],\n",
       " ['guntner', 'andreas'],\n",
       " ['ischer', 'philipp'],\n",
       " ['brunhart', 'andreas'],\n",
       " ['guenther', 'isabel'],\n",
       " ['kirstein', 'andreas'],\n",
       " ['vaterlaus', 'andreas'],\n",
       " ['kilcher', 'andreas'],\n",
       " ['greiner', 'andreas'],\n",
       " ['meyer', 'andreas'],\n",
       " ['muller', 'andreas', 'fritz'],\n",
       " ['heinz', 'andreas'],\n",
       " ['scheinost', 'andreas'],\n",
       " ['vozikis', 'athanassios'],\n",
       " ['baumgarten', 'andreas'],\n",
       " ['abele', 'wigert', 'isabelle'],\n",
       " ['simpson', 'isla'],\n",
       " ['thoma', 'andreas'],\n",
       " ['pauling', 'andreas'],\n",
       " ['stracke', 'andreas'],\n",
       " ['klusman', 'isabel'],\n",
       " ['sprock', 'andreas'],\n",
       " ['gunther', 'isabel'],\n",
       " ['agalianos', 'athanasios'],\n",
       " ['lochbihler', 'andreas'],\n",
       " ['atukeren', 'erdal'],\n",
       " ['schweizer', 'andreas'],\n",
       " ['muller', 'andreas'],\n",
       " ['papadopoulos', 'athanasios'],\n",
       " ['concheiro', 'isabel'],\n",
       " ['aeberli', 'isabelle'],\n",
       " ['nobs', 'andreas'],\n",
       " ['ishai', 'yuval'],\n",
       " ['providoli', 'isabelle'],\n",
       " ['neumann', 'andreas'],\n",
       " ['issacharoff', 'limor'],\n",
       " ['lang', 'andreas'],\n",
       " ['atkinson', 'stephen'],\n",
       " ['teske', 'andreas'],\n",
       " ['flache', 'andreas'],\n",
       " ['hadjar', 'andreas'],\n",
       " ['luft', 'andreas'],\n",
       " ['isaac', 'morna'],\n",
       " ['forest', 'isbell'],\n",
       " ['schuldt', 'andreas'],\n",
       " ['isselstein', 'johannes'],\n",
       " ['imamoglu', 'atac'],\n",
       " ['oschlies', 'andreas'],\n",
       " ['kleeb', 'andreas'],\n",
       " ['fery', 'andreas'],\n",
       " ['pausits', 'attila'],\n",
       " ['schobel', 'andreas'],\n",
       " ['witzig', 'andreas'],\n",
       " ['razen', 'andreas'],\n",
       " ['putz', 'andreas'],\n",
       " ['kundig', 'andreas'],\n",
       " ['weissl', 'andreas'],\n",
       " ['potthoff', 'andreas'],\n",
       " ['reinhardt', 'andreas'],\n",
       " ['rossmann', 'andreas'],\n",
       " ['kammer', 'andreas'],\n",
       " ['pausitz', 'attila'],\n",
       " ['ahrens', 'andreas'],\n",
       " ['gutmann', 'ethan'],\n",
       " ['siegrist', 'isabelle'],\n",
       " ['riedmiller', 'andreas'],\n",
       " ['rudow', 'andreas'],\n",
       " ['abdel', 'aty'],\n",
       " ['klinke', 'andreas'],\n",
       " ['schlapfer', 'isabelle'],\n",
       " ['bartlome', 'andreas'],\n",
       " ['tobler', 'andreas'],\n",
       " ['erhardt', 'andreas'],\n",
       " ['bruhwiler', 'andreas'],\n",
       " ['mambretti', 'isabella', 'margherita'],\n",
       " ['willich', 'andreas'],\n",
       " ['balthasar', 'andreas'],\n",
       " ['mueller', 'andreas'],\n",
       " ['isacson', 'kristina'],\n",
       " ['sprachenzentrum', 'der', 'universitat', 'und', 'der', 'eth', 'zurich'],\n",
       " ['burg', 'andreas'],\n",
       " ['seufert', 'andreas'],\n",
       " ['schenkel', 'isabelle'],\n",
       " ['zweifel', 'andreas'],\n",
       " ['reidmiller', 'andreas'],\n",
       " ['kohne', 'andreas'],\n",
       " ['filges', 'isabel'],\n",
       " ['hermann', 'andreas'],\n",
       " ['eth', 'wohnforum', 'eth', 'case'],\n",
       " ['eth', 'wohnforum', 'eth', 'case'],\n",
       " ['ismail', 'zadeh', 'alik'],\n",
       " ['manz', 'andreas'],\n",
       " ['ishigami', 'junya'],\n",
       " ['munger', 'andreas'],\n",
       " ['musing', 'andreas'],\n",
       " ['ishikawa', 'taishi'],\n",
       " ['schenk', 'andreas'],\n",
       " ['gutzwiller', 'andreas'],\n",
       " ['pedersen', 'atle'],\n",
       " ['blaszczyk', 'andreas'],\n",
       " ['borer', 'andreas'],\n",
       " ['meier', 'andreas'],\n",
       " ['jehle', 'andreas'],\n",
       " ['schalko', 'isabella'],\n",
       " ['reigber', 'andreas'],\n",
       " ['ecklebe', 'andreas'],\n",
       " ['etherton'],\n",
       " ['ishida', 'koichi'],\n",
       " ['krause', 'jonathan'],\n",
       " ['petho', 'attila'],\n",
       " ['karampatzakis', 'andreas'],\n",
       " ['milias', 'argeitis', 'andreas'],\n",
       " ['schmid', 'andreas'],\n",
       " ['geyer', 'schulz', 'andreas'],\n",
       " ['kurth', 'andreas'],\n",
       " ['atature', 'mete'],\n",
       " ['albayrak', 'ismail'],\n",
       " ['braun', 'isabel'],\n",
       " ['trayanov', 'atanas'],\n",
       " ['abdelkefi', 'atef'],\n",
       " ['isaacs', 'rebecca'],\n",
       " ['hempel', 'andreas'],\n",
       " ['singh', 'atul'],\n",
       " ['ruegg', 'andreas'],\n",
       " ['lamprecht', 'andreas'],\n",
       " ['adelmann', 'andreas'],\n",
       " ['matzarakis', 'andreas'],\n",
       " ['geiger', 'andreas'],\n",
       " ['christ', 'andreas'],\n",
       " ['oehler', 'andreas'],\n",
       " ['burg', 'andreas', 'peter'],\n",
       " ['badertscher', 'andreas'],\n",
       " ['feldmann', 'andreas'],\n",
       " ['kreiter', 'andreas'],\n",
       " ['meyer', 'heim', 'andreas'],\n",
       " ['tretter', 'andreas'],\n",
       " ['lugmayr', 'andreas'],\n",
       " ['wiesmann', 'andreas'],\n",
       " ['noever', 'andreas'],\n",
       " ['burg', 'andreas'],\n",
       " ['brunschweiler', 'andreas'],\n",
       " ['schranzhofer', 'andreas'],\n",
       " ['warin', 'isabelle'],\n",
       " ['ess', 'andreas'],\n",
       " ['maier', 'andreas'],\n",
       " ['galmarini', 'andreas'],\n",
       " ['luxmoore', 'isaac'],\n",
       " ['scholze', 'andreas'],\n",
       " ['mortensen', 'andreas'],\n",
       " ['isaac', 'chang'],\n",
       " ['streich', 'andreas'],\n",
       " ['furst', 'andreas'],\n",
       " ['atchison'],\n",
       " ['breitenmoser', 'andreas'],\n",
       " ['kettner', 'andreas'],\n",
       " ['droscher', 'andreas'],\n",
       " ['ulmer', 'andreas'],\n",
       " ['stoermer', 'andreas'],\n",
       " ['castell', 'uroz', 'ismael'],\n",
       " ['vott', 'andreas'],\n",
       " ['isidori'],\n",
       " ['istvan', 'zsolt'],\n",
       " ['leitner', 'andreas'],\n",
       " ['alyafawi', 'islam'],\n",
       " ['cavegn', 'andreas'],\n",
       " ['klipstein', 'andreas'],\n",
       " ['kuhn', 'andreas'],\n",
       " ['schluep', 'campo', 'isabelle'],\n",
       " ['bulling', 'andreas'],\n",
       " ['ishida', 'hidetoshi'],\n",
       " ['krause', 'thilo'],\n",
       " ['tunnermann', 'andreas'],\n",
       " ['bolten', 'andreas'],\n",
       " ['hurbain', 'isabelle'],\n",
       " ['atalayer', 'caglar'],\n",
       " ['brunner', 'andreas'],\n",
       " ['korfiati', 'athina'],\n",
       " ['sakai', 'atsushi'],\n",
       " ['steingoetter', 'andreas'],\n",
       " ['langer', 'andreas'],\n",
       " ['gangnat', 'isabelle'],\n",
       " ['kaab', 'andreas'],\n",
       " ['hutflesz', 'andreas'],\n",
       " ['diebold', 'andreas'],\n",
       " ['messner', 'andreas'],\n",
       " ['gregoriades', 'andreas'],\n",
       " ['chrystodoulides', 'andreas'],\n",
       " ['bircher', 'andreas'],\n",
       " ['keler', 'andreas'],\n",
       " ['simo', 'isabel'],\n",
       " ['mariescu', 'istodor', 'radu'],\n",
       " ['atienza', 'david'],\n",
       " ['berst', 'andreas'],\n",
       " ['doucet', 'isabelle'],\n",
       " ['marcaletti', 'andreas'],\n",
       " ['atlas', 'collaboration'],\n",
       " ['islam', 'bayzidul'],\n",
       " ['ispas', 'adriana'],\n",
       " ['ishii', 'masao'],\n",
       " ['andreasson', 'martin'],\n",
       " ['glindemann', 'andreas'],\n",
       " ['yuksel', 'ismail', 'emir'],\n",
       " ['budde', 'andreas'],\n",
       " ['tonder', 'andreas'],\n",
       " ['engel', 'andreas'],\n",
       " ['richter', 'andreas'],\n",
       " ['blochl', 'andreas'],\n",
       " ['donaubauer', 'andreas'],\n",
       " ['ebner', 'andreas'],\n",
       " ['agusti', 'juan', 'isolda'],\n",
       " ['koll', 'andreas'],\n",
       " ['atrens', 'andrej'],\n",
       " ['nussberger', 'andreas'],\n",
       " ['waeber', 'andreas'],\n",
       " ['steingotter', 'andreas'],\n",
       " ['atabaki', 'amir'],\n",
       " ['steffen', 'andreas'],\n",
       " ['kolb', 'andreas'],\n",
       " ['dengel', 'andreas'],\n",
       " ['froemelt', 'andreas'],\n",
       " ['isa'],\n",
       " ['isella'],\n",
       " ['meier', 'andreas'],\n",
       " ['economides', 'athena'],\n",
       " ['lauber', 'andreas'],\n",
       " ['isler', 'linus'],\n",
       " ['wursig', 'andreas'],\n",
       " ['hiltebrand', 'andreas'],\n",
       " ['hund', 'andreas'],\n",
       " ['zeller', 'andreas'],\n",
       " ['hosl', 'andreas'],\n",
       " ['henrich', 'andreas'],\n",
       " ['isarno', 'thomas'],\n",
       " ['braun', 'andreas'],\n",
       " ['vogt', 'andreas'],\n",
       " ['filler', 'andreas'],\n",
       " ['looser', 'andreas'],\n",
       " ['steiger', 'andreas'],\n",
       " ['hugi', 'andreas'],\n",
       " ['roesch', 'isabelle'],\n",
       " ['bartschi', 'andreas'],\n",
       " ['staudacher', 'andreas'],\n",
       " ['elmer', 'andreas'],\n",
       " ['schneider', 'oliver', 'nobs', 'andreas'],\n",
       " ['badoux', 'andreas'],\n",
       " ['krause', 'dieter'],\n",
       " ['deutsch', 'isaac'],\n",
       " ['fastrich', 'andreas'],\n",
       " ['wehrle', 'andreas'],\n",
       " ['schonbachler', 'isabelle'],\n",
       " ['atherton', 'nick'],\n",
       " ['hofer', 'andreas'],\n",
       " ['muller', 'andreas'],\n",
       " ['thuy', 'andreas'],\n",
       " ['atzori', 'luigi'],\n",
       " ['lichtenberger', 'andreas'],\n",
       " ['ishida'],\n",
       " ['ishino'],\n",
       " ['jossen', 'andreas'],\n",
       " ['jakoby', 'andreas'],\n",
       " ['wallraff', 'andreas'],\n",
       " ['gangnat', 'isabelle'],\n",
       " ['weber', 'frank', 'andreas'],\n",
       " ['voegelin', 'andreas'],\n",
       " ['pfrunder', 'andreas'],\n",
       " ['krause'],\n",
       " ['knecht', 'andreas'],\n",
       " ['isacchini', 'giulio'],\n",
       " ['ishikawa'],\n",
       " ['schroder', 'andreas'],\n",
       " ['voulodimos', 'athanasios'],\n",
       " ['thiede', 'andreas'],\n",
       " ['por', 'attila'],\n",
       " ['steger', 'andreas'],\n",
       " ['ishiwaki'],\n",
       " ['kominek', 'andreas'],\n",
       " ['steiner', 'andreas'],\n",
       " ['lehrach', 'andreas'],\n",
       " ['atzori', 'manfredo'],\n",
       " ['urakawa', 'atsushi'],\n",
       " ['hasler', 'andreas'],\n",
       " ['lu', 'qian', 'qi', 'isaac'],\n",
       " ['tiefenauer', 'andreas'],\n",
       " ['krause'],\n",
       " ['haas', 'andreas'],\n",
       " ['lokka', 'ismini'],\n",
       " ['tenzer', 'isabel'],\n",
       " ['alexopoulos', 'andreas'],\n",
       " ['tan', 'isabelle'],\n",
       " ['streich', 'andreas'],\n",
       " ['castellarin', 'attilio'],\n",
       " ['atkinson', 'malcolm'],\n",
       " ['krause', 'amrey'],\n",
       " ['rietbrock', 'andreas'],\n",
       " ['tani', 'atsuko'],\n",
       " ['pedersen', 'andreas'],\n",
       " ['panagopoulos', 'athanasios'],\n",
       " ['tollkuehn', 'andreas'],\n",
       " ['ghulam', 'atif', 'nabi'],\n",
       " ['hehn', 'andreas'],\n",
       " ['narayanan', 'athi'],\n",
       " ['kovacs', 'istvan'],\n",
       " ['traber', 'andreas'],\n",
       " ['huttermann', 'andreas'],\n",
       " ['kanehira', 'atsushi'],\n",
       " ['walli', 'andreas'],\n",
       " ['kain', 'andreas'],\n",
       " ['griesser', 'andreas'],\n",
       " ['aste', 'andreas'],\n",
       " ['wittmann', 'andreas'],\n",
       " ['attinger', 'sabine'],\n",
       " ['venzke', 'andreas'],\n",
       " ['feldmann', 'andreas', 'emil'],\n",
       " ['krause', 'renate'],\n",
       " ['mambretti', 'isabella'],\n",
       " ['monnet', 'isabelle'],\n",
       " ['burgt', 'andreas'],\n",
       " ['haselbacher', 'andreas'],\n",
       " ['kanarachos', 'andreas'],\n",
       " ['isella', 'giovanni'],\n",
       " ['krusi', 'philipp', 'andreas'],\n",
       " ['bogner', 'andreas'],\n",
       " ['schranzdorfer', 'andreas'],\n",
       " ['herrmann', 'andreas'],\n",
       " ['guyon', 'isabelle'],\n",
       " ['istvan', 'zsolt'],\n",
       " ['bachle', 'andreas'],\n",
       " ['isshiki'],\n",
       " ['atakan', 'burak'],\n",
       " ['dax', 'andreas'],\n",
       " ['voss', 'andreas'],\n",
       " ['suter', 'andreas'],\n",
       " ['takagi', 'atsushi'],\n",
       " ['baumann', 'andreas'],\n",
       " ['deistung', 'andreas'],\n",
       " ['vonderheit', 'andreas'],\n",
       " ['ishizuki', 'hideki'],\n",
       " ['atkinson'],\n",
       " ['attanasio', 'felipe'],\n",
       " ['nyffeler', 'andreas'],\n",
       " ['rummert', 'andreas'],\n",
       " ['hartmann', 'andreas'],\n",
       " ['babler', 'andreas'],\n",
       " ['wettstein', 'andreas'],\n",
       " ['alt', 'andreas'],\n",
       " ['ishida', 'koich'],\n",
       " ['markopoulou', 'athina'],\n",
       " ['ishida'],\n",
       " ['atature'],\n",
       " ['flueler', 'isabella'],\n",
       " ['kapur', 'ateet'],\n",
       " ['kurten', 'andreas'],\n",
       " ['isobe', 'masaaki'],\n",
       " ['elsener', 'andreas'],\n",
       " ['zisch', 'andreas', 'hugo'],\n",
       " ['elahidoost', 'atousa'],\n",
       " ['eggenberger', 'andreas'],\n",
       " ['zisch', 'andreas'],\n",
       " ['tillack', 'andreas'],\n",
       " ['graser', 'andreas'],\n",
       " ['hempel', 'andreas'],\n",
       " ['tollkuhn', 'andreas'],\n",
       " ['loukas', 'andreas'],\n",
       " ['isufifi', 'elvin'],\n",
       " ['veres', 'istvan'],\n",
       " ['ritter', 'andreas'],\n",
       " ['mantalaris', 'athanasios'],\n",
       " ['voltaire', 'andreas', 'meyer', 'de'],\n",
       " ['passariello', 'isabella'],\n",
       " ['ishii'],\n",
       " ['mayer', 'andreas'],\n",
       " ['atanasov', 'pavel'],\n",
       " ['atabaki', 'amir', 'hossein'],\n",
       " ['dax', 'andreas'],\n",
       " ['butte', 'atul'],\n",
       " ['tisa', 'andreas'],\n",
       " ['botti', 'ismael'],\n",
       " ['martinez', 'delgado', 'ismael'],\n",
       " ['morales', 'duran', 'isaac'],\n",
       " ['marquez', 'isabel'],\n",
       " ['sarajedini', 'ata'],\n",
       " ['stergiou', 'andreas'],\n",
       " ['ataman'],\n",
       " ['atukeren'],\n",
       " ['meier', 'andreas'],\n",
       " ['langner', 'andreas'],\n",
       " ['das', 'sarma', 'atish'],\n",
       " ['reiner', 'andreas'],\n",
       " ['elmiger', 'andreas'],\n",
       " ['taras', 'andreas'],\n",
       " ['weißl', 'andreas'],\n",
       " ['stoecklin', 'andreas'],\n",
       " ['aglianos', 'athanasios'],\n",
       " ['athanasopoulos'],\n",
       " ['isa', 'fabio'],\n",
       " ['rober', 'isabel'],\n",
       " ['scheidegger', 'andreas'],\n",
       " ['jorg', 'andreas'],\n",
       " ['vasilica', 'istrate'],\n",
       " ['gumann', 'andreas'],\n",
       " ['polti', 'athos'],\n",
       " ['luecke', 'andreas'],\n",
       " ['dreizler', 'andreas'],\n",
       " ['zschippang', 'andreas'],\n",
       " ['gigon', 'andreas'],\n",
       " ['wacker', 'andreas'],\n",
       " ['nowatzyk', 'andreas'],\n",
       " ['biri', 'andreas'],\n",
       " ['sizmann', 'andreas'],\n",
       " ['streun', 'andreas'],\n",
       " ['cherchneff', 'isabelle'],\n",
       " ['sargent', 'isabel'],\n",
       " ['felber', 'andreas'],\n",
       " ['bazzon', 'andreas'],\n",
       " ['le', 'mer', 'isabelle'],\n",
       " ['eckart', 'andreas'],\n",
       " ['bauer', 'isabella'],\n",
       " ['pautz', 'andreas'],\n",
       " ['rauber', 'andreas'],\n",
       " ['valera', 'isabel'],\n",
       " ['wernrud', 'andreas'],\n",
       " ['heinimann', 'andreas'],\n",
       " ['nakamura', 'atsushi'],\n",
       " ['fromelt', 'andreas'],\n",
       " ['mehmann', 'andreas'],\n",
       " ['peil', 'andreas'],\n",
       " ['etherington', 'james'],\n",
       " ['krause', 'elisabeth'],\n",
       " ['plazas', 'andreas'],\n",
       " ['soller', 'andreas'],\n",
       " ['vieli', 'andreas'],\n",
       " ['islam', 'nazia'],\n",
       " ['kovacs', 'istvan'],\n",
       " ['heinrich', 'andreas'],\n",
       " ['schwarz', 'andreas'],\n",
       " ['atherton'],\n",
       " ['schaller', 'andreas'],\n",
       " ['wirth', 'andreas'],\n",
       " ['hotker', 'andreas'],\n",
       " ['ley', 'andreas'],\n",
       " ['weber', 'andreas'],\n",
       " ['ruesch', 'andreas'],\n",
       " ['epp', 'andreas'],\n",
       " ['doessegger', 'andreas'],\n",
       " ['atala', 'marcos'],\n",
       " ['kamilaris', 'andreas'],\n",
       " ['ruedlinger', 'andreas'],\n",
       " ['studer', 'andreas'],\n",
       " ['zell', 'andreas'],\n",
       " ['brandlmaier', 'andreas'],\n",
       " ['attiya', 'hagit'],\n",
       " ['pfrommer', 'andreas'],\n",
       " ['badam', 'ishrat'],\n",
       " ['hammer', 'andreas'],\n",
       " ['obereder', 'andreas'],\n",
       " ['hossinger', 'andreas'],\n",
       " ['menzel', 'andreas'],\n",
       " ['istvan', 'zolt'],\n",
       " ['christon', 'andreas'],\n",
       " ['issa', 'ibrahim'],\n",
       " ['gartner', 'roer', 'isabelle'],\n",
       " ['zimmermann', 'andreas'],\n",
       " ['kempe', 'andreas'],\n",
       " ['atrash', 'amin'],\n",
       " ['adya', 'atul'],\n",
       " ['krause', 'rolf'],\n",
       " ['honecker', 'andreas'],\n",
       " ['lauchli', 'andreas'],\n",
       " ['atkinson', 'david'],\n",
       " ['guinouard', 'isabelle'],\n",
       " ['plazas', 'andreas', 'alejandro'],\n",
       " ['fratter', 'isabelle'],\n",
       " ['krause'],\n",
       " ['aumiller', 'andreas'],\n",
       " ['christl', 'iso'],\n",
       " ['isvoranu', 'florin'],\n",
       " ['atzenweiler'],\n",
       " ['andreas', 'christian'],\n",
       " ['hemp', 'andreas'],\n",
       " ['manzoor', 'atif'],\n",
       " ['magdon', 'ismail', 'malik'],\n",
       " ['ishaque', 'mashhood'],\n",
       " ['krause', 'andrea'],\n",
       " ['sagnes', 'isabelle'],\n",
       " ['atkinson', 'andrew'],\n",
       " ['panousopoulou', 'athanasia'],\n",
       " ['sanchez', 'isidro'],\n",
       " ['michels', 'andreas'],\n",
       " ['ehrsam', 'andreas'],\n",
       " ['el', 'ati', 'jalila'],\n",
       " ['atakan', 'huseyin'],\n",
       " ['aoyama', 'atsushi'],\n",
       " ['krause', 'christian'],\n",
       " ['schuh', 'andreas'],\n",
       " ['vogel', 'andreas'],\n",
       " ['atkin'],\n",
       " ['janecek', 'andreas'],\n",
       " ['cohen', 'ethan'],\n",
       " ['beyer', 'andreas'],\n",
       " ['oehler', 'andreas'],\n",
       " ['isaak', 'kate'],\n",
       " ['moser', 'andreas'],\n",
       " ['baumgartner', 'andreas'],\n",
       " ['fuhrer', 'andreas'],\n",
       " ['danklmayer', 'andreas'],\n",
       " ['lutterotti', 'andreas'],\n",
       " ['isenegger'],\n",
       " ['kind', 'andreas'],\n",
       " ['franck', 'andreas'],\n",
       " ['pedroni', 'andreas'],\n",
       " ['iser', 'rene'],\n",
       " ['isard', 'michael'],\n",
       " ['krause'],\n",
       " ['ruiz', 'isabel'],\n",
       " ['dibiasi', 'andreas'],\n",
       " ['bauder', 'andreas', 'christian'],\n",
       " ['heinzel', 'andreas'],\n",
       " ['ateniese', 'giuseppe'],\n",
       " ['kaiser', 'andreas'],\n",
       " ['ruiz', 'ascacibar', 'isabel'],\n",
       " ['herter', 'aeberli', 'isabelle'],\n",
       " ['buhler', 'andreas'],\n",
       " ['ishitsuka', 'kazuya'],\n",
       " ['ostmann', 'andreas'],\n",
       " ['voellmy', 'andreas'],\n",
       " ['kohler', 'andreas'],\n",
       " ['rodrigues', 'isabel'],\n",
       " ['wapp', 'andreas'],\n",
       " ['dimitriou', 'andreas'],\n",
       " ['riener', 'andreas'],\n",
       " ['nagler', 'andreas'],\n",
       " ['ischebeck', 'rasmus'],\n",
       " ['busslinger', 'andreas'],\n",
       " ['major', 'istvan'],\n",
       " ['por', 'attila'],\n",
       " ['roditakis', 'andreas'],\n",
       " ['bloch', 'andreas'],\n",
       " ['ispas', 'adrian'],\n",
       " ['attinger'],\n",
       " ['ethier', 'stephane'],\n",
       " ['jaleh', 'atefeh'],\n",
       " ['atad', 'ettedgui'],\n",
       " ['iseli', 'hans', 'peter'],\n",
       " ['kaizik', 'andreas'],\n",
       " ['lopez', 'fernandez', 'isaac'],\n",
       " ['etherton', 'melanie'],\n",
       " ['isaksson', 'tord'],\n",
       " ['rimbock', 'andreas'],\n",
       " ['gyenesei', 'attila'],\n",
       " ['zeidler', 'andreas'],\n",
       " ['fatton', 'ismael'],\n",
       " ['isler', 'oliver'],\n",
       " ['ruiz', 'ascacibar', 'isabel'],\n",
       " ['jocksch', 'andreas'],\n",
       " ['tillack', 'andreas'],\n",
       " ['isar'],\n",
       " ['schmidt', 'andreas'],\n",
       " ['nikolic', 'isidor'],\n",
       " ['pitsillides', 'andreas'],\n",
       " ['zurbrugg', 'andreas'],\n",
       " ['attina'],\n",
       " ['atteia'],\n",
       " ['israel'],\n",
       " ['krause', 'oliver'],\n",
       " ['atad', 'ettedgui', 'eli'],\n",
       " ['attili', 'tommaso'],\n",
       " ['wapf', 'andreas'],\n",
       " ['demosthenous', 'andreas'],\n",
       " ['michel', 'andreas'],\n",
       " ['streich', 'andreas', 'peter'],\n",
       " ['economou', 'athanassios'],\n",
       " ['andreas', 'lochbihler'],\n",
       " ['burgi', 'andreas'],\n",
       " ['winter', 'andreas'],\n",
       " ['fognini', 'andreas'],\n",
       " ['malar', 'andreas'],\n",
       " ['rohrbacher', 'andreas'],\n",
       " ['mantri', 'atul'],\n",
       " ['atzeni', 'gabriele'],\n",
       " ['mayr', 'andreas'],\n",
       " ['frutiger', 'andreas'],\n",
       " ['wittmer', 'andreas'],\n",
       " ['will', 'andreas'],\n",
       " ['oslandsbotn', 'andreas'],\n",
       " ['marfurt', 'andreas'],\n",
       " ['stadelmann', 'steffen', 'isabelle'],\n",
       " ['reitzmann', 'andreas'],\n",
       " ['baak', 'andreas'],\n",
       " ['isa', 'lucio'],\n",
       " ['ataman', 'meric'],\n",
       " ['koch', 'andreas'],\n",
       " ['krebs', 'andreas'],\n",
       " ['forizs', 'istvan'],\n",
       " ['isaksson', 'elisabeth'],\n",
       " ['paschalis', 'athanasios'],\n",
       " ['atizaz', 'ali'],\n",
       " ['istanbulluoglu', 'erkan'],\n",
       " ['pfaffhuber', 'andreas'],\n",
       " ['csaszar', 'attila'],\n",
       " ['hagmann', 'andreas'],\n",
       " ['hunkeler', 'andreas'],\n",
       " ['hirschi', 'andreas'],\n",
       " ['krause', 'jan'],\n",
       " ['luescher', 'andreas'],\n",
       " ['atakan', 'kuvvet'],\n",
       " ['atmanspacher'],\n",
       " ['wombacher', 'andreas'],\n",
       " ['osei', 'atiemo'],\n",
       " ['csaszar', 'attila'],\n",
       " ['unteidig', 'andreas'],\n",
       " ['maeder', 'andreas'],\n",
       " ['krause'],\n",
       " ['krause', 'rolf'],\n",
       " ['heinrich', 'andreas'],\n",
       " ['la', 'roi', 'andreas'],\n",
       " ['wirth', 'andreas'],\n",
       " ['hock', 'andreas'],\n",
       " ['krause'],\n",
       " ['atluri', 'vijay'],\n",
       " ['schonborn', 'andreas'],\n",
       " ['hug', 'isabelle'],\n",
       " ['attar', 'namdar'],\n",
       " ['namdar', 'attar'],\n",
       " ['ruedi', 'isabelle'],\n",
       " ['huwiler', 'andreas'],\n",
       " ['roesch', 'andreas'],\n",
       " ['hill', 'andreas'],\n",
       " ['gabriel', 'andreas'],\n",
       " ['fink', 'andreas'],\n",
       " ['fuchs', 'andreas'],\n",
       " ['malaer', 'andreas'],\n",
       " ['schaub', 'andreas'],\n",
       " ['zafeirakos', 'athanasios'],\n",
       " ['gobiet', 'andreas'],\n",
       " ['krause', 'diana'],\n",
       " ['stamer', 'andreas'],\n",
       " ['ali', 'atizaz'],\n",
       " ['vogelin', 'andreas'],\n",
       " ['athanassiou', 'evagelos'],\n",
       " ['nagy', 'istvan'],\n",
       " ['beerli', 'andreas'],\n",
       " ['gonzalez', 'vasco', 'maria', 'isabel'],\n",
       " ['ishihara'],\n",
       " ['joosten', 'andreas'],\n",
       " ['bruun', 'andreas'],\n",
       " ['bosio', 'andreas'],\n",
       " ['fischer', 'isabel'],\n",
       " ['gerber', 'isabel'],\n",
       " ['ischebeck'],\n",
       " ['isinger', 'marcus'],\n",
       " ['rosenberg', 'ethan'],\n",
       " ['drott', 'andreas'],\n",
       " ['hellerschmied', 'andreas'],\n",
       " ['ishibashi'],\n",
       " ['marcotte', 'isabelle'],\n",
       " ['rowald', 'andreas'],\n",
       " ['strubel', 'isabel'],\n",
       " ['hansel', 'andreas'],\n",
       " ['audetat', 'andreas'],\n",
       " ['kappler', 'andreas'],\n",
       " ['pessah', 'isaac'],\n",
       " ['hofer', 'sarah', 'isabelle'],\n",
       " ['sigfridsson', 'andreas'],\n",
       " ['sigfridsson', 'andreas'],\n",
       " ['morf', 'andreas'],\n",
       " ['poulos', 'andreas'],\n",
       " ['tympakianaki', 'athina'],\n",
       " ['frø', 'iselin'],\n",
       " ['michalski', 'andreas'],\n",
       " ['kemmler', 'andreas'],\n",
       " ['hintennach', 'andreas'],\n",
       " ['eggert', 'andreas'],\n",
       " ['iseghem', 'van'],\n",
       " ['ishihara'],\n",
       " ['ischer'],\n",
       " ['athanasopoulos', 'nikolaos'],\n",
       " ['leemann', 'andreas'],\n",
       " ['martinez', 'isabel'],\n",
       " ['ishida', 'akimasa'],\n",
       " ['von', 'felten', 'andreas'],\n",
       " ['huggler', 'isabelle'],\n",
       " ['ruiz', 'ascaciabr', 'isabel'],\n",
       " ['krause'],\n",
       " ['issa', 'al'],\n",
       " ['atkinson', 'james'],\n",
       " ['schlatter', 'andreas'],\n",
       " ['tanemura', 'atsushi'],\n",
       " ['gutzeit', 'andreas'],\n",
       " ['lauper', 'andreas'],\n",
       " ['hofmann', 'andreas'],\n",
       " ['hammelehle', 'andreas'],\n",
       " ['schubert', 'sandy', 'isabelle'],\n",
       " ['atal'],\n",
       " ['kovacs', 'istvan'],\n",
       " ['christl', 'daniel', 'iso'],\n",
       " ['yazici', 'atilla'],\n",
       " ['cakmak', 'ismail'],\n",
       " ['desbaillets', 'isabelle'],\n",
       " ['chalari', 'athena'],\n",
       " ['wurfl', 'andreas'],\n",
       " ['zuger', 'andreas'],\n",
       " ['trussel', 'andreas'],\n",
       " ['klein', 'andreas'],\n",
       " ['ludwig', 'andreas'],\n",
       " ['bucker', 'isabell'],\n",
       " ['senn', 'isabelle'],\n",
       " ['bansode', 'atul'],\n",
       " ['isabettini', 'stephane'],\n",
       " ['leibbrandt', 'andreas'],\n",
       " ['seidel', 'morgenstern', 'andreas'],\n",
       " ['isaak'],\n",
       " ['felten', 'andreas', 'von'],\n",
       " ['vollrath', 'andreas'],\n",
       " ['atarashi', 'andoh'],\n",
       " ['muenger', 'andreas'],\n",
       " ['schmitt', 'andreas'],\n",
       " ['lamperti', 'isabella'],\n",
       " ['krause', 'hans', 'michael'],\n",
       " ['fliessbach', 'andreas'],\n",
       " ['gattinger', 'andreas'],\n",
       " ['scheurer', 'andreas'],\n",
       " ['wachs', 'israel'],\n",
       " ['frolich', 'andreas'],\n",
       " ['atature'],\n",
       " ['krause', 'frank', 'michael'],\n",
       " ['eichler', 'andreas'],\n",
       " ['seiderer', 'andreas'],\n",
       " ['lokka', 'ismini', 'eleni'],\n",
       " ['atanasoski', 'nebojoa'],\n",
       " ['ayele', 'atalay'],\n",
       " ['tsoukalou', 'athanasia'],\n",
       " ['isaenko'],\n",
       " ['islam', 'shofiqul'],\n",
       " ['morel', 'isabelle'],\n",
       " ['gereckel', 'andreas'],\n",
       " ['savin', 'de', 'larclause', 'isabelle'],\n",
       " ['martinez', 'isabel'],\n",
       " ['manighetti', 'isabelle'],\n",
       " ['atrens'],\n",
       " ['burkert', 'andreas'],\n",
       " ['opitz', 'isabelle'],\n",
       " ['hilber', 'isabel'],\n",
       " ['grundmann', 'andreas'],\n",
       " ['iseskog', 'daniel'],\n",
       " ['brandle', 'andreas'],\n",
       " ['ishizawa', 'oscar'],\n",
       " ['graggen', 'andreas'],\n",
       " ['atarashi', 'andoh'],\n",
       " ['trussel', 'andreas'],\n",
       " ['kreuzer', 'andreas'],\n",
       " ['darzi', 'atefe'],\n",
       " ['reufer', 'andreas'],\n",
       " ['isa'],\n",
       " ['turler', 'andreas'],\n",
       " ['brink', 'andreas'],\n",
       " ['moller', 'andreas'],\n",
       " ['thielen', 'andreas'],\n",
       " ['sigfridsson', 'andreas', 'bjoern', 'joakim'],\n",
       " ['trumpp', 'andreas'],\n",
       " ['dunk', 'andreas', 'von', 'der'],\n",
       " ['oehler', 'andreas'],\n",
       " ['oehler', 'andreas'],\n",
       " ['attwood'],\n",
       " ['cacho', 'isabel'],\n",
       " ['nijman', 'isaac'],\n",
       " ['prohl', 'andreas'],\n",
       " ['islam'],\n",
       " ['quandt', 'andreas'],\n",
       " ['ishii', 'haruyuki'],\n",
       " ['boss', 'andreas'],\n",
       " ['gehring', 'andreas'],\n",
       " ['platz', 'andreas'],\n",
       " ['fliss', 'ismail'],\n",
       " ['atanasoski', 'suzana'],\n",
       " ['mulller', 'andreas'],\n",
       " ['grass', 'isabelle'],\n",
       " ['kolinko', 'isabel'],\n",
       " ['van', 'driessche', 'isabel'],\n",
       " ['kung', 'andreas'],\n",
       " ['ishibashi', 'wakiko'],\n",
       " ['roseboom', 'isaac'],\n",
       " ['borgschulte', 'andreas'],\n",
       " ['zuettel', 'andreas'],\n",
       " ['zitek', 'andreas'],\n",
       " ['romero', 'isart', 'oriol'],\n",
       " ['bogoch', 'isaac'],\n",
       " ['postlmayr', 'andreas'],\n",
       " ['isshiki', 'yoshiaki'],\n",
       " ['lam', 'athena'],\n",
       " ['atauri', 'pedro', 'de'],\n",
       " ['athri', 'prashanth'],\n",
       " ['weber', 'andreas'],\n",
       " ['stankov', 'atanas'],\n",
       " ['takaki', 'atsushi'],\n",
       " ['gisler', 'andreas'],\n",
       " ['stewart', 'ethan'],\n",
       " ['geier', 'andreas'],\n",
       " ['andreasson', 'jakob'],\n",
       " ['krause', 'johannes'],\n",
       " ['isaacson', 'rivka'],\n",
       " ['bach', 'andreas'],\n",
       " ['fernandez', 'golbano', 'isabel'],\n",
       " ['ishibashi', 'wako'],\n",
       " ['binet', 'isabelle'],\n",
       " ['ishikawa', 'ai'],\n",
       " ['winschall', 'andreas'],\n",
       " ['atkinson', 'james'],\n",
       " ['zuttel', 'andreas'],\n",
       " ['weihofen', 'andreas'],\n",
       " ['henry', 'isabelle'],\n",
       " ['taubert', 'andreas'],\n",
       " ['roschger', 'andreas'],\n",
       " ['gubler', 'andreas'],\n",
       " ['atallah', 'ayman'],\n",
       " ['pabst', 'andreas'],\n",
       " ['steinlin', 'andreas'],\n",
       " ['holm', 'andreas'],\n",
       " ['beck', 'andreas'],\n",
       " ['afseth', 'andreas'],\n",
       " ['atkinson'],\n",
       " ['bergthaler', 'andreas'],\n",
       " ['ishikawa', 'naoto'],\n",
       " ['kohl', 'issaku'],\n",
       " ['vollmy', 'andreas'],\n",
       " ['kankanhalli', 'atreyi'],\n",
       " ['sutter', 'andreas'],\n",
       " ['kalmar', 'isabelle'],\n",
       " ['wahl', 'andreas'],\n",
       " ['chromik', 'andreas'],\n",
       " ['dahlin', 'andreas'],\n",
       " ['hauser', 'andreas'],\n",
       " ['bieberstein', 'andreas'],\n",
       " ['ishioka'],\n",
       " ['dornbrack', 'andreas'],\n",
       " ['duffner', 'andreas'],\n",
       " ['roldan', 'ruiz', 'isabel'],\n",
       " ['hoser', 'andreas'],\n",
       " ['attin', 'thomas'],\n",
       " ['atake'],\n",
       " ['parcharidis', 'is'],\n",
       " ['atz'],\n",
       " ['ispolatov', 'iaroslav'],\n",
       " ['isenring', 'julia'],\n",
       " ['paris', 'isabelle'],\n",
       " ['nerlich', 'andreas'],\n",
       " ['musolff', 'andreas'],\n",
       " ['zenklusen', 'isabelle'],\n",
       " ['tholey', 'andreas'],\n",
       " ['istok', 'jonathan'],\n",
       " ['krause', 'cornelia'],\n",
       " ['tschumi', 'andreas'],\n",
       " ['uldschmid', 'andreas'],\n",
       " ['wyss', 'andreas'],\n",
       " ['jansen', 'andreas'],\n",
       " ['kaltenbrunner', 'andreas'],\n",
       " ['atala'],\n",
       " ['dupanloup', 'isabelle'],\n",
       " ['großimlinghaus', 'isabell'],\n",
       " ['goppelt', 'andreas'],\n",
       " ['luippold', 'andreas'],\n",
       " ['focks', 'andreas'],\n",
       " ['keller', 'isabel'],\n",
       " ['oliveira', 'isabel'],\n",
       " ['pluckthun', 'andreas'],\n",
       " ['donald', 'athene'],\n",
       " ['ishikawa', 'hayato'],\n",
       " ['wagner', 'andreas'],\n",
       " ['brand', 'andreas'],\n",
       " ['ismael', 'marina'],\n",
       " ['gerecke', 'andreas'],\n",
       " ['schertel', 'andreas'],\n",
       " ['schnyder', 'andreas'],\n",
       " ['lutter', 'andreas'],\n",
       " ['mochizuki', 'atsushi'],\n",
       " ['sieber', 'andreas'],\n",
       " ['huth', 'andreas'],\n",
       " ['ishii', 'miki'],\n",
       " ['natsch', 'andreas'],\n",
       " ['isaacs', 'mark'],\n",
       " ['hungerbuhler', 'andreas'],\n",
       " ['mader', 'andreas'],\n",
       " ['haeberlin', 'andreas'],\n",
       " ['gleiss', 'andreas'],\n",
       " ['rompp', 'andreas'],\n",
       " ['reiner', 'ethan'],\n",
       " ['dasargyri', 'athanasia'],\n",
       " ['lagaris', 'isaac'],\n",
       " ['tschupp', 'simon', 'andreas'],\n",
       " ['bremges', 'andreas'],\n",
       " ['heine', 'andreas'],\n",
       " ['ibrom', 'andreas'],\n",
       " ['milionis', 'athanasios'],\n",
       " ['islam', 'shofiqul', 'md'],\n",
       " ['atkinson', 'elizabeth'],\n",
       " ['yilmaz', 'atilgan'],\n",
       " ['naegeli', 'andreas'],\n",
       " ['paulke', 'andreas'],\n",
       " ['kagi', 'andreas'],\n",
       " ['wolf', 'isabella'],\n",
       " ['cruz', 'atienza'],\n",
       " ['atkinson'],\n",
       " ['atuah'],\n",
       " ['kiebele', 'andreas'],\n",
       " ['krause', 'stefan'],\n",
       " ['moor', 'andreas'],\n",
       " ['krause', 'lutz'],\n",
       " ['isermann'],\n",
       " ['domaizon', 'isabelle'],\n",
       " ['isakov', 'sergei'],\n",
       " ['fallgatter', 'andreas'],\n",
       " ['ethofer', 'thomas'],\n",
       " ['reif', 'andreas'],\n",
       " ['strubel', 'isabel', 'theresia'],\n",
       " ['iseya', 'fujiko'],\n",
       " ['eichenberger', 'andreas'],\n",
       " ['dix', 'andreas'],\n",
       " ['naef', 'andreas'],\n",
       " ['kocsis', 'istvan'],\n",
       " ['kingston', 'isabel'],\n",
       " ['raue', 'andreas'],\n",
       " ['wetzel', 'andreas'],\n",
       " ['sakaguchi', 'isao'],\n",
       " ['ishihara', 'morio'],\n",
       " ['kuglstatter', 'andreas'],\n",
       " ['isaksson', 'leif'],\n",
       " ...]"
      ]
     },
     "execution_count": 198,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "[sublist for sublist in author_name for item in sublist if pattern.match(item)]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 289,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "not an author\n",
      "not an organisation\n"
     ]
    }
   ],
   "source": [
    "query_match(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 288,
   "metadata": {},
   "outputs": [],
   "source": [
    "query = 'Andreas Krause is prof'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 267,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[['diekmann', 'andreas'],\n",
       " ['sennheiser', 'andreas'],\n",
       " ['wenger', 'andreas'],\n",
       " ['horni', 'andreas'],\n",
       " ['tonnesmann', 'andreas'],\n",
       " ['schallhorn', 'andreas'],\n",
       " ['huber', 'andreas'],\n",
       " ['papritz', 'andreas', 'jurg'],\n",
       " ['bauder', 'andreas'],\n",
       " ['frei', 'andreas'],\n",
       " ['ulbig', 'andreas'],\n",
       " ['fischlin', 'andreas'],\n",
       " ['hierlemann', 'andreas'],\n",
       " ['biedermann', 'andreas'],\n",
       " ['stemmer', 'andreas'],\n",
       " ['ernst', 'andreas'],\n",
       " ['denk', 'andreas'],\n",
       " ['voigt', 'andreas'],\n",
       " ['brunschweiger', 'andreas'],\n",
       " ['mueller', 'andreas'],\n",
       " ['krause', 'andreas'],\n",
       " ['krause', 'andreas'],\n",
       " ['kispert', 'andreas'],\n",
       " ['bernasconi', 'andreas'],\n",
       " ['kunz', 'andreas'],\n",
       " ['schellenberger', 'andreas'],\n",
       " ['schneider', 'andreas'],\n",
       " ['wieck', 'andreas'],\n",
       " ['wimmer', 'andreas'],\n",
       " ['schafer', 'andreas'],\n",
       " ['pira', 'andreas'],\n",
       " ['christen', 'andreas'],\n",
       " ['kalpakci', 'andreas'],\n",
       " ['wieser', 'andreas'],\n",
       " ['schulze', 'andreas'],\n",
       " ['kuchler', 'andreas'],\n",
       " ['luscher', 'andreas'],\n",
       " ['pospischil', 'andreas'],\n",
       " ['rigling', 'andreas'],\n",
       " ['schmid', 'andreas'],\n",
       " ['zingg', 'andreas'],\n",
       " ['mauthe', 'andreas'],\n",
       " ['fichtner', 'andreas'],\n",
       " ['agne', 'andreas'],\n",
       " ['metz', 'andreas'],\n",
       " ['bulan', 'andreas'],\n",
       " ['petzold', 'andreas'],\n",
       " ['hoenger', 'andreas'],\n",
       " ['guntner', 'andreas'],\n",
       " ['brunhart', 'andreas'],\n",
       " ['kirstein', 'andreas'],\n",
       " ['vaterlaus', 'andreas'],\n",
       " ['kilcher', 'andreas'],\n",
       " ['greiner', 'andreas'],\n",
       " ['meyer', 'andreas'],\n",
       " ['muller', 'andreas', 'fritz'],\n",
       " ['heinz', 'andreas'],\n",
       " ['scheinost', 'andreas'],\n",
       " ['baumgarten', 'andreas'],\n",
       " ['thoma', 'andreas'],\n",
       " ['pauling', 'andreas'],\n",
       " ['stracke', 'andreas'],\n",
       " ['sprock', 'andreas'],\n",
       " ['lochbihler', 'andreas'],\n",
       " ['schweizer', 'andreas'],\n",
       " ['muller', 'andreas'],\n",
       " ['nobs', 'andreas'],\n",
       " ['neumann', 'andreas'],\n",
       " ['lang', 'andreas'],\n",
       " ['teske', 'andreas'],\n",
       " ['flache', 'andreas'],\n",
       " ['hadjar', 'andreas'],\n",
       " ['luft', 'andreas'],\n",
       " ['schuldt', 'andreas'],\n",
       " ['oschlies', 'andreas'],\n",
       " ['kleeb', 'andreas'],\n",
       " ['fery', 'andreas'],\n",
       " ['schobel', 'andreas'],\n",
       " ['witzig', 'andreas'],\n",
       " ['razen', 'andreas'],\n",
       " ['putz', 'andreas'],\n",
       " ['kundig', 'andreas'],\n",
       " ['weissl', 'andreas'],\n",
       " ['potthoff', 'andreas'],\n",
       " ['reinhardt', 'andreas'],\n",
       " ['rossmann', 'andreas'],\n",
       " ['kammer', 'andreas'],\n",
       " ['ahrens', 'andreas'],\n",
       " ['riedmiller', 'andreas'],\n",
       " ['rudow', 'andreas'],\n",
       " ['klinke', 'andreas'],\n",
       " ['bartlome', 'andreas'],\n",
       " ['tobler', 'andreas'],\n",
       " ['erhardt', 'andreas'],\n",
       " ['bruhwiler', 'andreas'],\n",
       " ['willich', 'andreas'],\n",
       " ['balthasar', 'andreas'],\n",
       " ['mueller', 'andreas'],\n",
       " ['burg', 'andreas'],\n",
       " ['seufert', 'andreas'],\n",
       " ['zweifel', 'andreas'],\n",
       " ['reidmiller', 'andreas'],\n",
       " ['kohne', 'andreas'],\n",
       " ['hermann', 'andreas'],\n",
       " ['manz', 'andreas'],\n",
       " ['munger', 'andreas'],\n",
       " ['musing', 'andreas'],\n",
       " ['schenk', 'andreas'],\n",
       " ['gutzwiller', 'andreas'],\n",
       " ['blaszczyk', 'andreas'],\n",
       " ['borer', 'andreas'],\n",
       " ['meier', 'andreas'],\n",
       " ['jehle', 'andreas'],\n",
       " ['reigber', 'andreas'],\n",
       " ['ecklebe', 'andreas'],\n",
       " ['krause', 'jonathan'],\n",
       " ['karampatzakis', 'andreas'],\n",
       " ['milias', 'argeitis', 'andreas'],\n",
       " ['schmid', 'andreas'],\n",
       " ['geyer', 'schulz', 'andreas'],\n",
       " ['kurth', 'andreas'],\n",
       " ['hempel', 'andreas'],\n",
       " ['ruegg', 'andreas'],\n",
       " ['lamprecht', 'andreas'],\n",
       " ['adelmann', 'andreas'],\n",
       " ['matzarakis', 'andreas'],\n",
       " ['geiger', 'andreas'],\n",
       " ['christ', 'andreas'],\n",
       " ['oehler', 'andreas'],\n",
       " ['burg', 'andreas', 'peter'],\n",
       " ['badertscher', 'andreas'],\n",
       " ['feldmann', 'andreas'],\n",
       " ['kreiter', 'andreas'],\n",
       " ['meyer', 'heim', 'andreas'],\n",
       " ['tretter', 'andreas'],\n",
       " ['lugmayr', 'andreas'],\n",
       " ['wiesmann', 'andreas'],\n",
       " ['noever', 'andreas'],\n",
       " ['burg', 'andreas'],\n",
       " ['brunschweiler', 'andreas'],\n",
       " ['schranzhofer', 'andreas'],\n",
       " ['ess', 'andreas'],\n",
       " ['maier', 'andreas'],\n",
       " ['galmarini', 'andreas'],\n",
       " ['scholze', 'andreas'],\n",
       " ['mortensen', 'andreas'],\n",
       " ['streich', 'andreas'],\n",
       " ['furst', 'andreas'],\n",
       " ['breitenmoser', 'andreas'],\n",
       " ['kettner', 'andreas'],\n",
       " ['droscher', 'andreas'],\n",
       " ['ulmer', 'andreas'],\n",
       " ['stoermer', 'andreas'],\n",
       " ['vott', 'andreas'],\n",
       " ['leitner', 'andreas'],\n",
       " ['cavegn', 'andreas'],\n",
       " ['klipstein', 'andreas'],\n",
       " ['kuhn', 'andreas'],\n",
       " ['bulling', 'andreas'],\n",
       " ['krause', 'thilo'],\n",
       " ['tunnermann', 'andreas'],\n",
       " ['bolten', 'andreas'],\n",
       " ['brunner', 'andreas'],\n",
       " ['steingoetter', 'andreas'],\n",
       " ['langer', 'andreas'],\n",
       " ['kaab', 'andreas'],\n",
       " ['hutflesz', 'andreas'],\n",
       " ['diebold', 'andreas'],\n",
       " ['messner', 'andreas'],\n",
       " ['gregoriades', 'andreas'],\n",
       " ['chrystodoulides', 'andreas'],\n",
       " ['bircher', 'andreas'],\n",
       " ['keler', 'andreas'],\n",
       " ['berst', 'andreas'],\n",
       " ['marcaletti', 'andreas'],\n",
       " ['glindemann', 'andreas'],\n",
       " ['budde', 'andreas'],\n",
       " ['tonder', 'andreas'],\n",
       " ['engel', 'andreas'],\n",
       " ['richter', 'andreas'],\n",
       " ['blochl', 'andreas'],\n",
       " ['donaubauer', 'andreas'],\n",
       " ['ebner', 'andreas'],\n",
       " ['koll', 'andreas'],\n",
       " ['nussberger', 'andreas'],\n",
       " ['waeber', 'andreas'],\n",
       " ['steingotter', 'andreas'],\n",
       " ['steffen', 'andreas'],\n",
       " ['kolb', 'andreas'],\n",
       " ['dengel', 'andreas'],\n",
       " ['froemelt', 'andreas'],\n",
       " ['meier', 'andreas'],\n",
       " ['lauber', 'andreas'],\n",
       " ['wursig', 'andreas'],\n",
       " ['hiltebrand', 'andreas'],\n",
       " ['hund', 'andreas'],\n",
       " ['zeller', 'andreas'],\n",
       " ['hosl', 'andreas'],\n",
       " ['henrich', 'andreas'],\n",
       " ['braun', 'andreas'],\n",
       " ['vogt', 'andreas'],\n",
       " ['filler', 'andreas'],\n",
       " ['looser', 'andreas'],\n",
       " ['steiger', 'andreas'],\n",
       " ['hugi', 'andreas'],\n",
       " ['bartschi', 'andreas'],\n",
       " ['staudacher', 'andreas'],\n",
       " ['elmer', 'andreas'],\n",
       " ['schneider', 'oliver', 'nobs', 'andreas'],\n",
       " ['badoux', 'andreas'],\n",
       " ['krause', 'dieter'],\n",
       " ['fastrich', 'andreas'],\n",
       " ['wehrle', 'andreas'],\n",
       " ['hofer', 'andreas'],\n",
       " ['muller', 'andreas'],\n",
       " ['thuy', 'andreas'],\n",
       " ['lichtenberger', 'andreas'],\n",
       " ['jossen', 'andreas'],\n",
       " ['jakoby', 'andreas'],\n",
       " ['wallraff', 'andreas'],\n",
       " ['weber', 'frank', 'andreas'],\n",
       " ['voegelin', 'andreas'],\n",
       " ['pfrunder', 'andreas'],\n",
       " ['krause'],\n",
       " ['knecht', 'andreas'],\n",
       " ['schroder', 'andreas'],\n",
       " ['thiede', 'andreas'],\n",
       " ['steger', 'andreas'],\n",
       " ['kominek', 'andreas'],\n",
       " ['steiner', 'andreas'],\n",
       " ['lehrach', 'andreas'],\n",
       " ['hasler', 'andreas'],\n",
       " ['tiefenauer', 'andreas'],\n",
       " ['krause'],\n",
       " ['haas', 'andreas'],\n",
       " ['alexopoulos', 'andreas'],\n",
       " ['streich', 'andreas'],\n",
       " ['krause', 'amrey'],\n",
       " ['rietbrock', 'andreas'],\n",
       " ['pedersen', 'andreas'],\n",
       " ['tollkuehn', 'andreas'],\n",
       " ['hehn', 'andreas'],\n",
       " ['traber', 'andreas'],\n",
       " ['huttermann', 'andreas'],\n",
       " ['walli', 'andreas'],\n",
       " ['kain', 'andreas'],\n",
       " ['griesser', 'andreas'],\n",
       " ['aste', 'andreas'],\n",
       " ['wittmann', 'andreas'],\n",
       " ['venzke', 'andreas'],\n",
       " ['feldmann', 'andreas', 'emil'],\n",
       " ['krause', 'renate'],\n",
       " ['burgt', 'andreas'],\n",
       " ['haselbacher', 'andreas'],\n",
       " ['kanarachos', 'andreas'],\n",
       " ['krusi', 'philipp', 'andreas'],\n",
       " ['bogner', 'andreas'],\n",
       " ['schranzdorfer', 'andreas'],\n",
       " ['herrmann', 'andreas'],\n",
       " ['bachle', 'andreas'],\n",
       " ['dax', 'andreas'],\n",
       " ['voss', 'andreas'],\n",
       " ['suter', 'andreas'],\n",
       " ['baumann', 'andreas'],\n",
       " ['deistung', 'andreas'],\n",
       " ['vonderheit', 'andreas'],\n",
       " ['nyffeler', 'andreas'],\n",
       " ['rummert', 'andreas'],\n",
       " ['hartmann', 'andreas'],\n",
       " ['babler', 'andreas'],\n",
       " ['wettstein', 'andreas'],\n",
       " ['alt', 'andreas'],\n",
       " ['kurten', 'andreas'],\n",
       " ['elsener', 'andreas'],\n",
       " ['zisch', 'andreas', 'hugo'],\n",
       " ['eggenberger', 'andreas'],\n",
       " ['zisch', 'andreas'],\n",
       " ['tillack', 'andreas'],\n",
       " ['graser', 'andreas'],\n",
       " ['hempel', 'andreas'],\n",
       " ['tollkuhn', 'andreas'],\n",
       " ['loukas', 'andreas'],\n",
       " ['ritter', 'andreas'],\n",
       " ['voltaire', 'andreas', 'meyer', 'de'],\n",
       " ['mayer', 'andreas'],\n",
       " ['dax', 'andreas'],\n",
       " ['tisa', 'andreas'],\n",
       " ['stergiou', 'andreas'],\n",
       " ['meier', 'andreas'],\n",
       " ['langner', 'andreas'],\n",
       " ['reiner', 'andreas'],\n",
       " ['elmiger', 'andreas'],\n",
       " ['taras', 'andreas'],\n",
       " ['weißl', 'andreas'],\n",
       " ['stoecklin', 'andreas'],\n",
       " ['scheidegger', 'andreas'],\n",
       " ['jorg', 'andreas'],\n",
       " ['gumann', 'andreas'],\n",
       " ['luecke', 'andreas'],\n",
       " ['dreizler', 'andreas'],\n",
       " ['zschippang', 'andreas'],\n",
       " ['gigon', 'andreas'],\n",
       " ['wacker', 'andreas'],\n",
       " ['nowatzyk', 'andreas'],\n",
       " ['biri', 'andreas'],\n",
       " ['sizmann', 'andreas'],\n",
       " ['streun', 'andreas'],\n",
       " ['felber', 'andreas'],\n",
       " ['bazzon', 'andreas'],\n",
       " ['eckart', 'andreas'],\n",
       " ['pautz', 'andreas'],\n",
       " ['rauber', 'andreas'],\n",
       " ['wernrud', 'andreas'],\n",
       " ['heinimann', 'andreas'],\n",
       " ['fromelt', 'andreas'],\n",
       " ['mehmann', 'andreas'],\n",
       " ['peil', 'andreas'],\n",
       " ['krause', 'elisabeth'],\n",
       " ['plazas', 'andreas'],\n",
       " ['soller', 'andreas'],\n",
       " ['vieli', 'andreas'],\n",
       " ['heinrich', 'andreas'],\n",
       " ['schwarz', 'andreas'],\n",
       " ['schaller', 'andreas'],\n",
       " ['wirth', 'andreas'],\n",
       " ['hotker', 'andreas'],\n",
       " ['ley', 'andreas'],\n",
       " ['weber', 'andreas'],\n",
       " ['ruesch', 'andreas'],\n",
       " ['epp', 'andreas'],\n",
       " ['doessegger', 'andreas'],\n",
       " ['kamilaris', 'andreas'],\n",
       " ['ruedlinger', 'andreas'],\n",
       " ['studer', 'andreas'],\n",
       " ['zell', 'andreas'],\n",
       " ['brandlmaier', 'andreas'],\n",
       " ['pfrommer', 'andreas'],\n",
       " ['hammer', 'andreas'],\n",
       " ['obereder', 'andreas'],\n",
       " ['hossinger', 'andreas'],\n",
       " ['menzel', 'andreas'],\n",
       " ['christon', 'andreas'],\n",
       " ['zimmermann', 'andreas'],\n",
       " ['kempe', 'andreas'],\n",
       " ['krause', 'rolf'],\n",
       " ['honecker', 'andreas'],\n",
       " ['lauchli', 'andreas'],\n",
       " ['plazas', 'andreas', 'alejandro'],\n",
       " ['krause'],\n",
       " ['aumiller', 'andreas'],\n",
       " ['andreas', 'christian'],\n",
       " ['hemp', 'andreas'],\n",
       " ['krause', 'andrea'],\n",
       " ['michels', 'andreas'],\n",
       " ['ehrsam', 'andreas'],\n",
       " ['krause', 'christian'],\n",
       " ['schuh', 'andreas'],\n",
       " ['vogel', 'andreas'],\n",
       " ['janecek', 'andreas'],\n",
       " ['beyer', 'andreas'],\n",
       " ['oehler', 'andreas'],\n",
       " ['moser', 'andreas'],\n",
       " ['baumgartner', 'andreas'],\n",
       " ['fuhrer', 'andreas'],\n",
       " ['danklmayer', 'andreas'],\n",
       " ['lutterotti', 'andreas'],\n",
       " ['kind', 'andreas'],\n",
       " ['franck', 'andreas'],\n",
       " ['pedroni', 'andreas'],\n",
       " ['krause'],\n",
       " ['dibiasi', 'andreas'],\n",
       " ['bauder', 'andreas', 'christian'],\n",
       " ['heinzel', 'andreas'],\n",
       " ['kaiser', 'andreas'],\n",
       " ['buhler', 'andreas'],\n",
       " ['ostmann', 'andreas'],\n",
       " ['voellmy', 'andreas'],\n",
       " ['kohler', 'andreas'],\n",
       " ['wapp', 'andreas'],\n",
       " ['dimitriou', 'andreas'],\n",
       " ['riener', 'andreas'],\n",
       " ['nagler', 'andreas'],\n",
       " ['busslinger', 'andreas'],\n",
       " ['roditakis', 'andreas'],\n",
       " ['bloch', 'andreas'],\n",
       " ['kaizik', 'andreas'],\n",
       " ['rimbock', 'andreas'],\n",
       " ['zeidler', 'andreas'],\n",
       " ['jocksch', 'andreas'],\n",
       " ['tillack', 'andreas'],\n",
       " ['schmidt', 'andreas'],\n",
       " ['pitsillides', 'andreas'],\n",
       " ['zurbrugg', 'andreas'],\n",
       " ['krause', 'oliver'],\n",
       " ['wapf', 'andreas'],\n",
       " ['demosthenous', 'andreas'],\n",
       " ['michel', 'andreas'],\n",
       " ['streich', 'andreas', 'peter'],\n",
       " ['andreas', 'lochbihler'],\n",
       " ['burgi', 'andreas'],\n",
       " ['winter', 'andreas'],\n",
       " ['fognini', 'andreas'],\n",
       " ['malar', 'andreas'],\n",
       " ['rohrbacher', 'andreas'],\n",
       " ['mayr', 'andreas'],\n",
       " ['frutiger', 'andreas'],\n",
       " ['wittmer', 'andreas'],\n",
       " ['will', 'andreas'],\n",
       " ['oslandsbotn', 'andreas'],\n",
       " ['marfurt', 'andreas'],\n",
       " ['reitzmann', 'andreas'],\n",
       " ['baak', 'andreas'],\n",
       " ['koch', 'andreas'],\n",
       " ['krebs', 'andreas'],\n",
       " ['pfaffhuber', 'andreas'],\n",
       " ['hagmann', 'andreas'],\n",
       " ['hunkeler', 'andreas'],\n",
       " ['hirschi', 'andreas'],\n",
       " ['krause', 'jan'],\n",
       " ['luescher', 'andreas'],\n",
       " ['wombacher', 'andreas'],\n",
       " ['unteidig', 'andreas'],\n",
       " ['maeder', 'andreas'],\n",
       " ['krause'],\n",
       " ['krause', 'rolf'],\n",
       " ['heinrich', 'andreas'],\n",
       " ['la', 'roi', 'andreas'],\n",
       " ['wirth', 'andreas'],\n",
       " ['hock', 'andreas'],\n",
       " ['krause'],\n",
       " ['schonborn', 'andreas'],\n",
       " ['huwiler', 'andreas'],\n",
       " ['roesch', 'andreas'],\n",
       " ['hill', 'andreas'],\n",
       " ['gabriel', 'andreas'],\n",
       " ['fink', 'andreas'],\n",
       " ['fuchs', 'andreas'],\n",
       " ['malaer', 'andreas'],\n",
       " ['schaub', 'andreas'],\n",
       " ['gobiet', 'andreas'],\n",
       " ['krause', 'diana'],\n",
       " ['stamer', 'andreas'],\n",
       " ['vogelin', 'andreas'],\n",
       " ['beerli', 'andreas'],\n",
       " ['joosten', 'andreas'],\n",
       " ['bruun', 'andreas'],\n",
       " ['bosio', 'andreas'],\n",
       " ['drott', 'andreas'],\n",
       " ['hellerschmied', 'andreas'],\n",
       " ['rowald', 'andreas'],\n",
       " ['hansel', 'andreas'],\n",
       " ['audetat', 'andreas'],\n",
       " ['kappler', 'andreas'],\n",
       " ['sigfridsson', 'andreas'],\n",
       " ['sigfridsson', 'andreas'],\n",
       " ['morf', 'andreas'],\n",
       " ['poulos', 'andreas'],\n",
       " ['michalski', 'andreas'],\n",
       " ['kemmler', 'andreas'],\n",
       " ['hintennach', 'andreas'],\n",
       " ['eggert', 'andreas'],\n",
       " ['leemann', 'andreas'],\n",
       " ['von', 'felten', 'andreas'],\n",
       " ['krause'],\n",
       " ['schlatter', 'andreas'],\n",
       " ['gutzeit', 'andreas'],\n",
       " ['lauper', 'andreas'],\n",
       " ['hofmann', 'andreas'],\n",
       " ['hammelehle', 'andreas'],\n",
       " ['wurfl', 'andreas'],\n",
       " ['zuger', 'andreas'],\n",
       " ['trussel', 'andreas'],\n",
       " ['klein', 'andreas'],\n",
       " ['ludwig', 'andreas'],\n",
       " ['leibbrandt', 'andreas'],\n",
       " ['seidel', 'morgenstern', 'andreas'],\n",
       " ['felten', 'andreas', 'von'],\n",
       " ['vollrath', 'andreas'],\n",
       " ['muenger', 'andreas'],\n",
       " ['schmitt', 'andreas'],\n",
       " ['krause', 'hans', 'michael'],\n",
       " ['fliessbach', 'andreas'],\n",
       " ['gattinger', 'andreas'],\n",
       " ['scheurer', 'andreas'],\n",
       " ['frolich', 'andreas'],\n",
       " ['krause', 'frank', 'michael'],\n",
       " ['eichler', 'andreas'],\n",
       " ['seiderer', 'andreas'],\n",
       " ['gereckel', 'andreas'],\n",
       " ['burkert', 'andreas'],\n",
       " ['grundmann', 'andreas'],\n",
       " ['brandle', 'andreas'],\n",
       " ['graggen', 'andreas'],\n",
       " ['trussel', 'andreas'],\n",
       " ['kreuzer', 'andreas'],\n",
       " ['reufer', 'andreas'],\n",
       " ['turler', 'andreas'],\n",
       " ['brink', 'andreas'],\n",
       " ['moller', 'andreas'],\n",
       " ['thielen', 'andreas'],\n",
       " ['sigfridsson', 'andreas', 'bjoern', 'joakim'],\n",
       " ['trumpp', 'andreas'],\n",
       " ['dunk', 'andreas', 'von', 'der'],\n",
       " ['oehler', 'andreas'],\n",
       " ['oehler', 'andreas'],\n",
       " ['prohl', 'andreas'],\n",
       " ['quandt', 'andreas'],\n",
       " ['boss', 'andreas'],\n",
       " ['gehring', 'andreas'],\n",
       " ['platz', 'andreas'],\n",
       " ['mulller', 'andreas'],\n",
       " ['kung', 'andreas'],\n",
       " ['borgschulte', 'andreas'],\n",
       " ['zuettel', 'andreas'],\n",
       " ['zitek', 'andreas'],\n",
       " ['postlmayr', 'andreas'],\n",
       " ['weber', 'andreas'],\n",
       " ['gisler', 'andreas'],\n",
       " ['geier', 'andreas'],\n",
       " ['krause', 'johannes'],\n",
       " ['bach', 'andreas'],\n",
       " ['winschall', 'andreas'],\n",
       " ['zuttel', 'andreas'],\n",
       " ['weihofen', 'andreas'],\n",
       " ['taubert', 'andreas'],\n",
       " ['roschger', 'andreas'],\n",
       " ['gubler', 'andreas'],\n",
       " ['pabst', 'andreas'],\n",
       " ['steinlin', 'andreas'],\n",
       " ['holm', 'andreas'],\n",
       " ['beck', 'andreas'],\n",
       " ['afseth', 'andreas'],\n",
       " ['bergthaler', 'andreas'],\n",
       " ['vollmy', 'andreas'],\n",
       " ['sutter', 'andreas'],\n",
       " ['wahl', 'andreas'],\n",
       " ['chromik', 'andreas'],\n",
       " ['dahlin', 'andreas'],\n",
       " ['hauser', 'andreas'],\n",
       " ['bieberstein', 'andreas'],\n",
       " ['dornbrack', 'andreas'],\n",
       " ['duffner', 'andreas'],\n",
       " ['hoser', 'andreas'],\n",
       " ['nerlich', 'andreas'],\n",
       " ['musolff', 'andreas'],\n",
       " ['tholey', 'andreas'],\n",
       " ['krause', 'cornelia'],\n",
       " ['tschumi', 'andreas'],\n",
       " ['uldschmid', 'andreas'],\n",
       " ['wyss', 'andreas'],\n",
       " ['jansen', 'andreas'],\n",
       " ['kaltenbrunner', 'andreas'],\n",
       " ['goppelt', 'andreas'],\n",
       " ['luippold', 'andreas'],\n",
       " ['focks', 'andreas'],\n",
       " ['pluckthun', 'andreas'],\n",
       " ['wagner', 'andreas'],\n",
       " ['brand', 'andreas'],\n",
       " ['gerecke', 'andreas'],\n",
       " ['schertel', 'andreas'],\n",
       " ['schnyder', 'andreas'],\n",
       " ['lutter', 'andreas'],\n",
       " ['sieber', 'andreas'],\n",
       " ['huth', 'andreas'],\n",
       " ['natsch', 'andreas'],\n",
       " ['hungerbuhler', 'andreas'],\n",
       " ['mader', 'andreas'],\n",
       " ['haeberlin', 'andreas'],\n",
       " ['gleiss', 'andreas'],\n",
       " ['rompp', 'andreas'],\n",
       " ['tschupp', 'simon', 'andreas'],\n",
       " ['bremges', 'andreas'],\n",
       " ['heine', 'andreas'],\n",
       " ['ibrom', 'andreas'],\n",
       " ['naegeli', 'andreas'],\n",
       " ['paulke', 'andreas'],\n",
       " ['kagi', 'andreas'],\n",
       " ['kiebele', 'andreas'],\n",
       " ['krause', 'stefan'],\n",
       " ['moor', 'andreas'],\n",
       " ['krause', 'lutz'],\n",
       " ['fallgatter', 'andreas'],\n",
       " ['reif', 'andreas'],\n",
       " ['eichenberger', 'andreas'],\n",
       " ['dix', 'andreas'],\n",
       " ['naef', 'andreas'],\n",
       " ['raue', 'andreas'],\n",
       " ['wetzel', 'andreas'],\n",
       " ['kuglstatter', 'andreas'],\n",
       " ['sturzenegger', 'andreas'],\n",
       " ['ziegler', 'andreas'],\n",
       " ['ludwig', 'andreas'],\n",
       " ['zimmer', 'andreas'],\n",
       " ['jodal', 'andreas'],\n",
       " ['zottel', 'andreas'],\n",
       " ['tschofen', 'andreas'],\n",
       " ['bracher', 'andreas'],\n",
       " ['quirrenbach', 'andreas'],\n",
       " ['polk', 'andreas'],\n",
       " ['thiel', 'andreas'],\n",
       " ['kuschel', 'andreas'],\n",
       " ['lennartsson', 'andreas'],\n",
       " ['blomkvist', 'andreas'],\n",
       " ['reichmuth', 'andreas'],\n",
       " ['bernhard', 'andreas'],\n",
       " ['lauchli', 'andreas'],\n",
       " ['ruckstuhl', 'andreas', 'franz'],\n",
       " ['leng', 'andreas'],\n",
       " ['guntner', 'andreas'],\n",
       " ['averesch', 'andreas'],\n",
       " ['fischbach', 'andreas'],\n",
       " ['vilcinskas', 'andreas'],\n",
       " ['birkefeld', 'andreas'],\n",
       " ['beil', 'andreas'],\n",
       " ['dirks', 'andreas'],\n",
       " ['kaczmarczyk', 'andreas'],\n",
       " ['eugster', 'andreas'],\n",
       " ['gloger', 'andreas'],\n",
       " ['dounas', 'andreas'],\n",
       " ['kniss', 'andreas'],\n",
       " ['jenni', 'andreas'],\n",
       " ['rueegg', 'andreas'],\n",
       " ['bernhard', 'andreas'],\n",
       " ['riedinger', 'andreas'],\n",
       " ['fagereng', 'andreas'],\n",
       " ['dehnert', 'andreas'],\n",
       " ['marzinzik', 'andreas'],\n",
       " ['binkert', 'andreas'],\n",
       " ['lerchner', 'andreas'],\n",
       " ['buser', 'andreas'],\n",
       " ['stirling', 'andreas'],\n",
       " ['gehring', 'andreas'],\n",
       " ['conzelmann', 'andreas'],\n",
       " ['melzer', 'andreas'],\n",
       " ['kazantzidis', 'andreas'],\n",
       " ['trabesinger', 'andreas'],\n",
       " ['grubelnik', 'andreas'],\n",
       " ['schmehl', 'andreas'],\n",
       " ['mai', 'andreas'],\n",
       " ['hirsch', 'andreas'],\n",
       " ['braendle', 'andreas'],\n",
       " ['stein', 'andreas'],\n",
       " ['huhmer', 'andreas'],\n",
       " ['kloti', 'andreas'],\n",
       " ['pfund', 'andreas'],\n",
       " ['meyer', 'lindenberg', 'andreas'],\n",
       " ['schlicker', 'andreas'],\n",
       " ['pfenninger', 'andreas'],\n",
       " ['bayer', 'andreas'],\n",
       " ['hauri', 'andreas'],\n",
       " ['steimer', 'andreas'],\n",
       " ['flohre', 'andreas'],\n",
       " ['bikfalvi', 'andreas'],\n",
       " ['tschannen', 'andreas'],\n",
       " ['koeberle', 'andreas'],\n",
       " ['dollinger', 'andreas'],\n",
       " ['kretschmann', 'andreas'],\n",
       " ['roos', 'andreas'],\n",
       " ['kronz', 'andreas'],\n",
       " ['schlitzer', 'andreas'],\n",
       " ['dahl', 'andreas'],\n",
       " ['krause', 'sabine'],\n",
       " ['zogg', 'andreas'],\n",
       " ['ehler', 'andreas'],\n",
       " ['aemisegger', 'andreas'],\n",
       " ['deussen', 'andreas'],\n",
       " ['muller', 'andreas'],\n",
       " ['ulrich', 'andreas'],\n",
       " ['hofinger', 'andreas'],\n",
       " ['kammer', 'andreas'],\n",
       " ['seitz', 'andreas'],\n",
       " ['kuhne', 'andreas'],\n",
       " ['messmer', 'andreas'],\n",
       " ['katopodis', 'andreas'],\n",
       " ['peckhaus', 'andreas'],\n",
       " ['kappeler', 'andreas'],\n",
       " ['bergner', 'andreas'],\n",
       " ['bapst', 'andreas'],\n",
       " ['weinberger', 'andreas'],\n",
       " ['zumbuehl', 'andreas'],\n",
       " ['thomann', 'andreas'],\n",
       " ['luthi', 'andreas'],\n",
       " ['reimann', 'andreas'],\n",
       " ['bertogg', 'andreas'],\n",
       " ['krauchi', 'andreas'],\n",
       " ['schaffer', 'andreas'],\n",
       " ['kuehne', 'andreas'],\n",
       " ['fischer', 'andreas'],\n",
       " ['stenke', 'andreas'],\n",
       " ['fix', 'andreas'],\n",
       " ['schafler', 'andreas'],\n",
       " ['baumgaertner', 'andreas'],\n",
       " ['billich', 'andreas'],\n",
       " ['litscher', 'andreas'],\n",
       " ['kotowicz', 'andreas'],\n",
       " ['bosshart', 'andreas'],\n",
       " ['matern', 'andreas'],\n",
       " ['zollinger', 'andreas'],\n",
       " ['bergmann', 'andreas'],\n",
       " ['gloss', 'andreas'],\n",
       " ['krause'],\n",
       " ['muhlbauer', 'andreas'],\n",
       " ['koller', 'andreas'],\n",
       " ['galler', 'andreas'],\n",
       " ['kroh', 'andreas'],\n",
       " ['monstein', 'christian', 'andreas'],\n",
       " ['fischer', 'andreas', 'marc'],\n",
       " ['krause', 'matthias'],\n",
       " ['loschel', 'andreas'],\n",
       " ['pichlmair', 'andreas'],\n",
       " ['farnleitner', 'andreas'],\n",
       " ['hurst', 'andreas'],\n",
       " ['zuend', 'andreas'],\n",
       " ['buhrig', 'polaczek', 'andreas'],\n",
       " ['hille', 'andreas'],\n",
       " ['fieselmann', 'andreas'],\n",
       " ['wiegmann', 'andreas'],\n",
       " ['gollner', 'andreas'],\n",
       " ['niemeier', 'andreas'],\n",
       " ['richter', 'andreas'],\n",
       " ['muller', 'andreas'],\n",
       " ['luckge', 'andreas'],\n",
       " ['faisst', 'andreas'],\n",
       " ['fluri', 'david', 'andreas'],\n",
       " ['reinhard', 'andreas'],\n",
       " ['grommek', 'andreas'],\n",
       " ['escher', 'andreas'],\n",
       " ['plach', 'andreas'],\n",
       " ['born', 'andreas'],\n",
       " ['gaumann', 'andreas'],\n",
       " ['dietzel', 'andreas'],\n",
       " ['korn', 'andreas'],\n",
       " ['janecke', 'andreas'],\n",
       " ['lorke', 'andreas'],\n",
       " ['zoller', 'frank', 'andreas'],\n",
       " ['roesch', 'andreas'],\n",
       " ['blennow', 'andreas'],\n",
       " ['krause', 'alexandra'],\n",
       " ['appenzeller', 'andreas'],\n",
       " ['krieg', 'andreas'],\n",
       " ['handel', 'andreas'],\n",
       " ['andreas', 'martin'],\n",
       " ['ritler', 'andreas'],\n",
       " ['hemmerich', 'andreas'],\n",
       " ['ahl', 'andreas'],\n",
       " ['essig', 'andreas'],\n",
       " ['johnsson', 'andreas'],\n",
       " ['brauchlin', 'andreas'],\n",
       " ['jung', 'andreas'],\n",
       " ['stohl', 'andreas'],\n",
       " ['rosch', 'andreas'],\n",
       " ['cornet', 'andreas'],\n",
       " ['stadler', 'andreas'],\n",
       " ['leithner', 'andreas'],\n",
       " ['pack', 'andreas'],\n",
       " ['peter', 'andreas'],\n",
       " ['graber', 'andreas'],\n",
       " ['herber', 'andreas'],\n",
       " ['massling', 'andreas'],\n",
       " ['przystawik', 'andreas'],\n",
       " ['blessenohl', 'michael', 'andreas'],\n",
       " ['flammer', 'andreas'],\n",
       " ['kjær', 'andreas'],\n",
       " ['pasch', 'andreas'],\n",
       " ['hafner', 'andreas'],\n",
       " ['ruegg', 'andreas'],\n",
       " ['schramm', 'andreas'],\n",
       " ['poppl', 'andreas'],\n",
       " ['stauble', 'andreas'],\n",
       " ['hug', 'andreas'],\n",
       " ['hueni', 'andreas'],\n",
       " ['linsbauer', 'andreas'],\n",
       " ['bick', 'andreas'],\n",
       " ['pfeiffer', 'andreas'],\n",
       " ['papritz', 'andreas'],\n",
       " ['schmittner', 'andreas'],\n",
       " ['schulze', 'bonhage', 'andreas'],\n",
       " ['muhar', 'andreas'],\n",
       " ['boland', 'andreas'],\n",
       " ['maurer', 'andreas'],\n",
       " ['neuenkirch', 'andreas'],\n",
       " ['burkart', 'andreas'],\n",
       " ['luch', 'andreas'],\n",
       " ['zumbuhl', 'andreas'],\n",
       " ['hamfelt', 'andreas'],\n",
       " ['goeke', 'andreas'],\n",
       " ['osterwalder', 'andreas'],\n",
       " ['hack', 'andreas'],\n",
       " ['ostrowski', 'andreas'],\n",
       " ['brandhuber', 'andreas'],\n",
       " ['macrander', 'andreas'],\n",
       " ['gadmer', 'andreas'],\n",
       " ['gutsch', 'andreas'],\n",
       " ['wicki', 'andreas'],\n",
       " ['schweitzer', 'andreas'],\n",
       " ['zuttel', 'andreas'],\n",
       " ['gauer', 'andreas'],\n",
       " ['hoppe', 'andreas'],\n",
       " ['klay', 'andreas'],\n",
       " ['tilgner', 'andreas'],\n",
       " ['oelsner', 'andreas'],\n",
       " ['landig', 'andreas'],\n",
       " ['scherz', 'andreas'],\n",
       " ['barth', 'andreas'],\n",
       " ['enggist', 'andreas'],\n",
       " ['weiss', 'andreas'],\n",
       " ['herzog', 'andreas'],\n",
       " ['ehlers', 'andreas'],\n",
       " ['noelle', 'andreas'],\n",
       " ['bapst', 'andreas'],\n",
       " ['schaper', 'andreas'],\n",
       " ['nuesch', 'andreas'],\n",
       " ['muhlbauer', 'andreas'],\n",
       " ['bliersbach', 'andreas'],\n",
       " ['fischer', 'andreas'],\n",
       " ['hess', 'andreas'],\n",
       " ['caduff', 'andreas'],\n",
       " ['gisel', 'andreas'],\n",
       " ['bruder', 'andreas'],\n",
       " ['schnyder', 'andreas'],\n",
       " ['schild', 'andreas'],\n",
       " ['rickenbacher', 'andreas'],\n",
       " ['kreuzer', 'andreas'],\n",
       " ['dinklage', 'andreas'],\n",
       " ['burkhart', 'andreas'],\n",
       " ['weigel', 'andreas'],\n",
       " ['schaffer', 'andreas'],\n",
       " ['schachner', 'andreas'],\n",
       " ['schilling', 'andreas'],\n",
       " ['kornath', 'andreas'],\n",
       " ['klay', 'andreas'],\n",
       " ['lindenblatt', 'andreas'],\n",
       " ['schell', 'andreas'],\n",
       " ['friedrich', 'andreas'],\n",
       " ['schieber', 'andreas'],\n",
       " ['becht', 'andreas'],\n",
       " ['kurtz', 'andreas'],\n",
       " ['rudolph', 'andreas'],\n",
       " ['muller', 'andreas'],\n",
       " ['panagiotidis', 'andreas'],\n",
       " ['fangmeier', 'andreas'],\n",
       " ['goricki', 'andreas'],\n",
       " ['buchleitner', 'andreas'],\n",
       " ['isacsson', 'andreas'],\n",
       " ['krause', 'sven'],\n",
       " ['herdlitschka', 'andreas'],\n",
       " ['christodoulides', 'andreas'],\n",
       " ['krause', 'jens'],\n",
       " ['wischnewski', 'andreas'],\n",
       " ['brech', 'andreas'],\n",
       " ['zund', 'andreas'],\n",
       " ['frei', 'andreas'],\n",
       " ['wiesbauer', 'andreas'],\n",
       " ['burger', 'andreas'],\n",
       " ['menrad', 'andreas'],\n",
       " ['kuendig', 'andreas'],\n",
       " ['reinecke', 'andreas'],\n",
       " ['boeckler', 'andreas'],\n",
       " ['pawlak', 'andreas'],\n",
       " ['boeckler', 'gerhard', 'andreas'],\n",
       " ['scholl', 'andreas'],\n",
       " ['bosshard', 'andreas'],\n",
       " ['heinz', 'andreas', 'heinz'],\n",
       " ['buckl', 'andreas'],\n",
       " ['kemna', 'andreas'],\n",
       " ['bausch', 'andreas'],\n",
       " ['huehmer', 'andreas'],\n",
       " ['stucki', 'andreas'],\n",
       " ['hoeflich', 'andreas'],\n",
       " ['roemer', 'andreas'],\n",
       " ['halman', 'andreas'],\n",
       " ['koehler', 'andreas'],\n",
       " ['schirmer', 'andreas'],\n",
       " ['eisingerich', 'andreas'],\n",
       " ['haldi', 'andreas'],\n",
       " ['andreas'],\n",
       " ['port', 'andreas'],\n",
       " ['strohle', 'andreas'],\n",
       " ['krause', 'sven'],\n",
       " ['lingel', 'andreas'],\n",
       " ['minikin', 'andreas'],\n",
       " ['giez', 'andreas'],\n",
       " ['zahn', 'andreas'],\n",
       " ['chaniotis', 'andreas'],\n",
       " ['haufler', 'andreas'],\n",
       " ['ciroth', 'andreas'],\n",
       " ['tribsch', 'andreas'],\n",
       " ['kaufmann', 'andreas'],\n",
       " ['cerny', 'andreas'],\n",
       " ['siegenthaler', 'andreas'],\n",
       " ['limacher', 'andreas'],\n",
       " ['hangauer', 'andreas'],\n",
       " ['kortenkamp', 'andreas'],\n",
       " ['laeuchli', 'andreas'],\n",
       " ['sundermann', 'andreas'],\n",
       " ['krause', 'ursula'],\n",
       " ['arnold', 'andreas'],\n",
       " ['jedlitschka', 'andreas'],\n",
       " ['frank', 'andreas'],\n",
       " ['goessl', 'andreas'],\n",
       " ['thor', 'andreas'],\n",
       " ['faissner', 'andreas'],\n",
       " ['birk', 'andreas'],\n",
       " ['kluge', 'andreas'],\n",
       " ['breil', 'fabio', 'andreas'],\n",
       " ['reiserer', 'andreas'],\n",
       " ['graggen', 'andreas'],\n",
       " ['walti', 'martin', 'andreas'],\n",
       " ['wehinger', 'andreas'],\n",
       " ['buchmann', 'andreas'],\n",
       " ['mayer', 'andreas'],\n",
       " ['gorling', 'andreas'],\n",
       " ['lieb', 'andreas'],\n",
       " ['gantenbein', 'andreas'],\n",
       " ['schmocker', 'andreas'],\n",
       " ['rudiger', 'hannes', 'andreas'],\n",
       " ['kieper', 'andreas'],\n",
       " ['dutly', 'andreas'],\n",
       " ['jahn', 'andreas'],\n",
       " ['haffter', 'andreas'],\n",
       " ['mehltretter', 'andreas'],\n",
       " ['frank', 'andreas'],\n",
       " ['christensen', 'mikkel', 'andreas'],\n",
       " ['rennings', 'andreas'],\n",
       " ['kruess', 'andreas'],\n",
       " ['kauk', 'andreas'],\n",
       " ['tuerk', 'andreas'],\n",
       " ['detken', 'andreas'],\n",
       " ['muesing', 'andreas'],\n",
       " ['schaefer', 'andreas'],\n",
       " ['krause', 'niklas'],\n",
       " ['molisch', 'andreas'],\n",
       " ['kleeb', 'andreas'],\n",
       " ['rettich', 'andreas'],\n",
       " ['colliander', 'andreas'],\n",
       " ['kaiser', 'andreas'],\n",
       " ['beyersdorf', 'andreas'],\n",
       " ['pfaltz', 'andreas'],\n",
       " ['brockhinke', 'andreas'],\n",
       " ['beck', 'andreas'],\n",
       " ['zieger', 'andreas'],\n",
       " ['keller', 'andreas'],\n",
       " ['steinberg', 'andreas'],\n",
       " ['nerlich', 'andreas'],\n",
       " ['pfeiffer', 'andreas'],\n",
       " ['fall', 'andreas'],\n",
       " ['schedl', 'andreas'],\n",
       " ['hahn', 'andreas'],\n",
       " ['wurm', 'andreas'],\n",
       " ['jakob', 'andreas'],\n",
       " ['bachmann', 'andreas'],\n",
       " ['karrenbauer', 'andreas'],\n",
       " ['hirt', 'andreas'],\n",
       " ['bumbacher', 'andreas'],\n",
       " ['jupke', 'andreas'],\n",
       " ['wachter', 'andreas'],\n",
       " ['lange', 'andreas'],\n",
       " ['kuhbacher', 'andreas'],\n",
       " ['frick', 'andreas'],\n",
       " ['dobler', 'andreas'],\n",
       " ['haensler', 'andreas'],\n",
       " ['prein', 'andreas'],\n",
       " ['maercker', 'andreas'],\n",
       " ['froba', 'andreas', 'paul'],\n",
       " ['draguhn', 'andreas'],\n",
       " ['krause', 'kim'],\n",
       " ['jentys', 'andreas'],\n",
       " ['keiser', 'andreas'],\n",
       " ['ruland', 'jan', 'andreas'],\n",
       " ['buser', 'andreas'],\n",
       " ['bielmann', 'andreas'],\n",
       " ['hagendorff', 'andreas'],\n",
       " ['tiran', 'andreas'],\n",
       " ['ladurner', 'andreas'],\n",
       " ['hanisch', 'andreas'],\n",
       " ['scharf', 'andreas'],\n",
       " ['schaefer', 'andreas'],\n",
       " ['aslund', 'andreas'],\n",
       " ['drager', 'andreas'],\n",
       " ['jurgeit', 'andreas'],\n",
       " ['schuppert', 'andreas'],\n",
       " ['manoli', 'andreas'],\n",
       " ['hessler', 'andreas'],\n",
       " ['bartl', 'andreas'],\n",
       " ['schlundt', 'andreas'],\n",
       " ['malekos', 'andreas'],\n",
       " ['camponovo', 'andreas'],\n",
       " ['kohl', 'andreas'],\n",
       " ['goller', 'andreas'],\n",
       " ['zischg', 'andreas'],\n",
       " ['nockhers', 'andreas'],\n",
       " ['schiller', 'andreas'],\n",
       " ['volz', 'thomas', 'andreas'],\n",
       " ['hoffmann', 'ocon', 'andreas'],\n",
       " ['herkersdorf', 'andreas'],\n",
       " ['krafft', 'andreas'],\n",
       " ['latz', 'andreas'],\n",
       " ['gebhardt', 'andreas'],\n",
       " ['aschauer', 'andreas'],\n",
       " ['hoechner', 'andreas'],\n",
       " ...]"
      ]
     },
     "execution_count": 267,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "[sublist for sublist in author_name for item in sublist if item in norm_query]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 257,
   "metadata": {},
   "outputs": [],
   "source": [
    "norm_query = normalise(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 101,
   "metadata": {},
   "outputs": [],
   "source": [
    "matching_author = [v for v in author_name if set(query) == set(v)]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 103,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 103,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "matching_author"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 104,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "empty\n"
     ]
    }
   ],
   "source": [
    "if matching_author == []:\n",
    "    print('empty')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Dictionary Method"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [],
   "source": [
    "def create_dic(query_type):\n",
    "    dep_org_prof = all_info[query_type].unique()\n",
    "    dep_org_prof = dep_org_prof[1:] # removed first as nan\n",
    "    dic_out = {i: True for i in dep_org_prof}\n",
    "    return dic_out"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [],
   "source": [
    "departments = create_dic('department')\n",
    "organisations = create_dic('organisation')\n",
    "professor = create_dic('author')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 78,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'Geistes-, Sozial- und Staatswissenschaften': True,\n",
       " 'Maschinenbau und Verfahrenstechnik': True,\n",
       " 'Gesundheitswissenschaften und Technologie': True,\n",
       " 'Architektur': True,\n",
       " 'Mathematik': True,\n",
       " 'Bau, Umwelt und Geomatik': True,\n",
       " 'Biosysteme': True,\n",
       " 'Biologie': True,\n",
       " 'Umweltsystemwissenschaften': True,\n",
       " 'Management, Technologie und Ökonomie': True,\n",
       " 'Physik': True,\n",
       " 'Chemie und Angewandte Biowissenschaften': True,\n",
       " 'Informationstechnologie und Elektrotechnik': True,\n",
       " 'Informatik': True,\n",
       " 'Materialwissenschaft': True,\n",
       " 'Erdwissenschaften': True}"
      ]
     },
     "execution_count": 78,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "departments"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 213,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "re.compile('andreas|krause|is|professor|at|eth')\n"
     ]
    }
   ],
   "source": [
    "query ='Andreas Krause'\n",
    "norm_query = normalise(query)\n",
    "pattern = re.compile(\"|\".join(norm_query))\n",
    "print(pattern)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Neo4J: Building the Expert score function"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<br>\n",
    "<br>\n",
    "\n",
    "            #Add weights between authors and publications\n",
    "            MATCH (p:Publication) - [r:PUBLISHED] - (a:Person)\n",
    "            SET r.weight = 1-toFloat(duration.between(p.date, date(\"2020-01-01\")).years)/toFloat(duration.between(date(\"1930-01-01\"),date(\"2020-01-01\")).years)\n",
    "            \n",
    "            #Add word count property to Topic nodes\n",
    "            MATCH (w:Word) -[r:IS_IN] -(t:Topic)\n",
    "            WITH t, count(w) as cnt\n",
    "            SET t.word_count = cnt\n",
    "            \n",
    "            #Add publication count property to Topic nodes\n",
    "            MATCH (p:Publication) -[r:IS_ABOUT] -(t:Topic)\n",
    "            WITH t, count(p) as cnt\n",
    "            SET t.pub_count = cnt\n",
    "            \n",
    "            #Create EXPERT_ON relationship between authors and topics\n",
    "            #Note: To avoid memory issues, use WHERE for selection on subsets of departments\n",
    "            #Ex: WHERE d.name IN ['Information Technology and Electrical Engineering', 'Mathematics']\n",
    "            #Engineering choice: Exponential when computing alpha\n",
    "            WITH 0.75 AS alpha_exp\n",
    "            MATCH (t:Topic)-[r1:IS_ABOUT]-(p:Publication)-[r2:PUBLISHED]-(a:Person)-[r3:WORKS_IN]-(d:Department)\n",
    "            WITH t, a, toFloat(count(p)) as cnt, alpha_exp\n",
    "            WITH t, a,\n",
    "               CASE WHEN cnt>=10.0\n",
    "                  THEN 1\n",
    "                  ELSE (cnt/10.0)^(alpha_exp)\n",
    "               END AS alpha\n",
    "            CREATE (a) - [r4:EXPERT_ON] -> (t)\n",
    "            \n",
    "            #Create score property on EXPERT_ON relationship\n",
    "            #Again, select on department to avoid memory issues\n",
    "            #Engineering choice: Exponentials for word count and publication count\n",
    "            WITH 63 AS min_pub_count, 9 AS min_word_count\n",
    "            MATCH (t:Topic)-[r1:IS_ABOUT]-(p:Publication)-[r2:PUBLISHED]-(a:Person)-[r3:WORKS_IN]-(d:Department)\n",
    "            WITH t, a, AVG(r1.weight*r2.weight)*(min_word_count/toFloat(t.word_count))^(0.75)*(min_pub_count/toFloat(t.pub_count))^(1) as s\n",
    "            MATCH (t)-[r4:EXPERT_ON]-(a)\n",
    "            SET r4.score = s*r4.alpha\n",
    "            \n",
    "            "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Expert Query Example"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<br>\n",
    "<br>\n",
    "\n",
    "            #Find experts on Climate Change\n",
    "            #Find all topics that contain all search terms\n",
    "            #Aggregate expert scores, by summing over all scores between topic & author\n",
    "            #and weighting by the sum of the word probabilities in topic\n",
    "            #Engineering choice: Sum or average to aggregate word probabilites\n",
    "            WITH ['climat', 'chang']\n",
    "            as words\n",
    "            MATCH (w:Word)-[r1:IS_IN]-(t:Topic)\n",
    "            WHERE w.name in words\n",
    "            WITH t, size(words) as inputCnt, count(DISTINCT w) as cnt, SUM(r1.weight) as s\n",
    "            WHERE cnt = inputCnt\n",
    "            WITH  t, s\n",
    "            MATCH (t:Topic)-[r3:EXPERT_ON] - (p:Person)-[r2:WORKS_IN]-(d:Department)\n",
    "            WITH p, SUM(r3.score*s) as s2, d\n",
    "            RETURN p.name, s2, d.name\n",
    "            ORDER BY s2 DESC"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
